[
  "- RO man",
  "!execute",
  "?",
  "( ͡° ͜ʖ ͡°)",
  "*bongo sort",
  "\"is not iterable\"",
  "\"minor changes\" \"small changes\" \"major changes\"",
  "```\n// eslint-disable-next-line @typescript-eslint/no-explicit-any\n```\n<:pepe_akysz:921397796555358279>",
  "```npm init vite```",
  "```ts\n/**\n * The client code picks a concrete strategy and passes it to the context. The\n * client should be aware of the differences between strategies in order to make\n * the right choice.\n */\nconst context = new Context(new ConcreteStrategyA());\nconsole.log('Client: Strategy is set to normal sorting.');\ncontext.doSomeBusinessLogic();\n\nconsole.log('');\n\nconsole.log('Client: Strategy is set to reverse sorting.');\ncontext.setStrategy(new ConcreteStrategyB());\ncontext.doSomeBusinessLogic();\n```",
  "```ts\nArgument of type 'FieldName<FieldValuesFromFieldErrors<DeepMap<DeepPartial<TFormValues>, FieldError>>>' is not assignable to parameter of type 'Path<TFormValues>'.\n  Type 'string | Extract<keyof FieldValuesFromFieldErrors<DeepMap<DeepPartial<TFormValues>, FieldError>>, string>' is not assignable to type 'Path<TFormValues>'.\n    Type 'string' is not assignable to type 'Path<TFormValues>'.\n```\na ten blad masz? w tym przykladzie od goscia mi sie pojawil jak dalem tamten typ od name",
  "```ts\nexport type OrderPayer = Olaf | undefined;\n```",
  "```ts\nimport Link from 'next/link';\n\nimport { PostMeta } from '../../types/post';\n\nimport styles from './postList.module.scss';\n\nexport interface PostListProps {\n  postsMeta: PostMeta[];\n}\n\nfunction generate(data: PostMeta[]) {\n    return data.map(({ title, slug, excerpt, date, category }) => (\n        const props = { title, slug, excerpt, date, category };\n        return <OtherComponent {...props} />\n    ));\n}\nexport default function PostList(props: PostListProps) {\n  return (\n    <ul className={styles['post-list']}>\n      {generate(props.postsMeta)}\n    </ul>\n  );\n}\n```\ncos takiego mialem na mysli",
  "```ts\nJSX.IntrinsicElements['img']\n```\nto dobry typ na obrazek?",
  "<:loo_panie:918791680633757718>",
  "<:sadge:918794259866484826>",
  "<@!395929433292406785> a z tym Flutterem, widzę że są 2 renderery do wyboru canvaskit i html , jest jakas roznica, pomiedzy dwoma? domyslam sie ze canvaskit to ten z canvasem",
  "<@!750658281554575411> tak jak wspomniał przedmówca brakuje await, \nhttps://developer.mozilla.org/en-US/docs/Web/API/Response/json",
  "<@!768352684566118400> z ktorym teraz masz blad dokladnie",
  "<@!904980902885617685> tak z ciekawosci robisz jakies konkretne zadanie z neta czy to własna inwencja czy może rekrutacyjne?",
  "<@219163538675990528> masz 20 lat tak jak na githubie?",
  "<#918805325929390091> < --- zapraszam tutaj",
  "<div>",
  "🤦",
  "1 pytanie brzmi co to jest funktor",
  "1,5 g to ja nawet do domu nie doniose",
  "1001 wzorców projektowych siostry anastazji",
  "2 zawsze bedzie korona to co jest wkorzeniu",
  "4 raz odpowiem jeszcze raz upraszczając pytanie, czy nic sie nie wywali w moim kodzie",
  "5 jest pierwsze na prawo i pozniej 9 tez sie zgadza, 4 zaslonieta przez 5",
  "6 latki do szkol i pozniej takie efekty ze przed matura juz 3 lata doswiadczenia",
  "8.40 z nvm mi nie idzie - błą∂ podczas kompilacji",
  "a asm masz w jedynkach i zerach i tak",
  "a blad jest tam gdzie uzywam tej metody",
  "a bo zmienilem na szybko i zostawilem",
  "a bootcamp league wiadomo kiedy będzie ?",
  "a c++ masz w asm i tak",
  "a co jak trzeba będzie w C, tam nie ma map i filter",
  "a co jest innego zamiast tego zeby miec taką samą funkcjonalność, media query?",
  "a co konkretnie bylo nie tak, w porownaniu do zwykłego reacta np.",
  "a co",
  "a cos lepszego od rhf sie jeszcze znajdzie czy to bedzie takie goto na dzien dzisiejszy?",
  "a cos nie dziala, czy jest ok?",
  "a cra jaka wersja",
  "a czesc pod haslem ktore ustawia serwisant, tylko ze to haslo ustawial wszystkim u ktorych wprowadzal zmiany takie same",
  "a czy wy już przyjęliście elixir?",
  "a czyli ma to coś wspólnego z ts?",
  "a da sie wyniuchac kiedy sticky jest sticky w latwy sposob?",
  "a dalej jeszcze 2 check byl potrzebny",
  "a do czego to tym razem",
  "a dogehouse chyba nie był w RN? tylko po prostu apka webowa",
  "a druga rzecz nad ktora sie zastanwialem to teraz zeby przerobic to na reuzywalny komponent tylko wiadomo nie taki jak byl wczesniej",
  "a expo vs vanilla?",
  "a FieldErrors<TFieldValues> podejdzie?",
  "a formika probowales, czy po prostu padl na to wybor bo znalazles tutorial?",
  "a gatsby to nie jest takie troche zamierzchle tak w ogole przypadkiem albo malo uzywane?",
  "a i rust wszystkiego sam nie zalatwia",
  "a ile się tak w ciągu dnia da zrobić, mao, dużo ?",
  "a inspirowałem się tym https://github.com/facebook/react/issues/4244",
  "a jak będę chciał używać bazy?",
  "a jak cos sie w stringa wstawia i jest undefined to zmienia sie w undefined , więc wtedy ? val : \"\" \ndobrze kminie?",
  "a jak sie zmniejszy szerokosc strony i jeden z 3 artykulow lamie sie na dol, i zostaje wolna przestrzena na prawo, to tak powinno to wygladac czy powinno sie dazyc do tego zeby design byl rowny i np. w takiej sytuacji ulozyc jeden nad drugim w kolumnie",
  "a jaka byla idea tego pytania, bo tez srednio rozumiem",
  "a jaka to jest ta jedna linijka?",
  "a jakby zrobic np. drugi parametr np. boola i w zaleznosci od niego zwracac na podstawie tych samych danych inny komponent, to juz byłaby potrzebna?",
  "a jedyna roznica jaka bedzie z interface a abstract class. to ze abstract class istnieje w programie po uruchomieniu i mozna uzywac instanceof",
  "a jest cos zlego w optional children? chyba tak to powinno dzialac czy zle to rozumiem",
  "a jezeli chcemy miec tylko taki context to nie trzeba nam nic po srodku zgadza sie?",
  "a jezeli chodzi o konstruktory to np. jak chcialoby sie inicjalizowac obiektem to robi sie interface osobno do tego obiektu ?",
  "a jezeli chodzi o po prostu zwykle funkcje to \"jest\"?",
  "a jezeli umowa zawiera stawke godzinowa, to jest to jakis hack czy mozna tak normalnie zrobic?",
  "a kto panu takiego regexpa wygenerowal",
  "a map jest czym zeby sobie to do ts playground dac?",
  "a mieliscie jeszcze w szkolach myszki z kulkami czy tylko ja taki stary jestem",
  "a moze ja cos zle rozumiem, chwilka",
  "a myslales zeby wlasne rozwiazanie zrobic?",
  "a myszke co łapie?",
  "a na samej gorze jest ten let imageToSent z defaultowym obrazkiem",
  "a najlepiej sie ich uzywa w klasach",
  "a nawet dają kod, i mówią że można wykorzystać ku chwale ojczyzny",
  "a nazwy do errorow samemu sie wymysla tak?",
  "a nie , chyba dalej tak jet",
  "a nie bylo tak w przypadku interface'u",
  "a nie chodzi przypadkiem o to ze position: relative , brakuje na parencie?",
  "a nie klasy z funkcją ?",
  "a nie przepraszam",
  "a nie wiemy co to jest i sprawdzamy dlatego w srodku",
  "a no wlasnie, jak masz klucz to tak to chyba jest w ramach dobrych praktyk nie powinno sie swojego klucza rozpowszechniac, to tak jakbys chcial swoje demo wystawic",
  "a potem juz jest to co trzeba",
  "a pozniej sobie sprawdzam  pod jakim katem jest index4 do index3",
  "a probowalem przed chwila object.prototype.hasownproperty.call i nie pomoglo",
  "a propo poziomu to pamietam cos takiego",
  "a react native web ma chociaz przyszlosc ?",
  "a sam ten naglowek sie powinien przynajmniej w najprostszym wariancie np. zlamac na pol",
  "a skeleton nie jest tylko do treści?",
  "a strong juniorzy też mogą aplikować?",
  "a szkoda, chyba nie jest to czesto wykorzystywane rozwiązanie, tylko raczej unika się tego na mobilkach zgadza sie?",
  "a tak nie bylo przypadkiem na poczatku?",
  "a tak wlasciwie to sobie mozna samemu takie tauri zrobic, tylko trzeba sobie samemu zapewnić ewentualną multiplatformowosc",
  "a takie sytuacje jak jakies errory na http albo malformed json ?",
  "a ten przyklad z map mi sie nie swieci",
  "a to any musi byc tylko w takim razie zgadza sie?",
  "a to API jest z kluczem albo ma jakiś limit zapytań?",
  "a to bys musial sprawdzic bo ponoc on jest tak zrobiony zeby go nie uzywac na vm",
  "a to includes to mozna uzyc czy o co chodzi",
  "a to ja tak nie mam, u nas każdy miał punkty za samo przyjście",
  "a to juz moze zalezec od paczki",
  "a to możesz mnie poprawić",
  "a to nie jest tak, że to co się składa to jest biznesplan, w którym trzeba jakoś opisać jak się przewiduje rozwój firmy tj. w co sie inwestuje i jaki zysk sie przewiduje?",
  "a to sie kiedys zdezaktualizowalo czy od poczatku jest jakies problematyczne?",
  "a to tez jest disqus ale to dla mnie taka patola trochę wole samemu zrobić sobie komentarze tak jak ma to być prawidłowo",
  "a to tez jest fajne, mieszkasz w zapyziałej dziurze i dadzą ci kasę na przeprowadzkę do np. wojewódzkiego żeby się ogarnąć",
  "a to warto to sprawdzic, bo to moze byc taki drawback",
  "a to wyzej co ma",
  "a tutaj poprawny",
  "a w czym to, php? jak tak to nie chce",
  "a w ogóle to polecam https://styled-components.com/",
  "a w ogóle to taki junior musi cisnąć żeby wyrobic dniowke, czy moze sie opierdalac",
  "a w ogole wiesz jaka to czcionka rozmiar, takie dane?",
  "A w prawym narożniku zawodnik Warsaw Bootcamp Academy, trenowany przez znanego i cenionego trenera Sławomira Zelenta, w dorobku posiada CRUD'a w PHP i portfolio z jquery",
  "a w szczegolnosci te nowsze standardy w C, bo to ze w C++ duzo zmieniaja to wiem a ze w C to nie mam takiej wiedzy",
  "a w tym designie nie jest to przypadkiem jako tekst czy wlasnie jest to juz gotowa grafika?",
  "a wlasnie a jak u ciebie są przechwytywane naciśnięcia np. na taki model?",
  "a z drugiej studenci co studiują informatykę i nie potrafią bypassa ogarnąć",
  "a z expressem to tez niezla zagwozdka jest, bo kiedys chyba body-parser byl osobno, a teraz z tego co wiem jest wlaczony, a niektorym weszlo to w krew i dalej instalują",
  "a z takich denerwujących rzeczy to pamiętam, że czasami aplikacja na jakiejś pierdółce może wywalić błąd jak się reloaduje",
  "a z tym widgetem to tez ciekawe, zostalo juz to wdrozone?",
  "a zeby literki przydzielic po indexie moglaby byc funkcja ktora przydziela w kolejnosci od a do z i jak się skonczy to np. aa , ab itd. i do tego zrobic z tego funkcje memo",
  "a zoda uzywales?",
  "A: Chłopie jak ty props drilling robisz w komponentach\nB: A ty nawet nie wiesz co to klasa",
  "Abstract Data Type,  najlepiej tworzyć za pomocą klasy",
  "aha bo pisales ze model",
  "aha, że w ogóle inaczej od tego?",
  "akurat jeszcze z tym nie walczyłem ale chyba w tych plikach astro formater nie jest zalaczony",
  "akurat zanim skasował jak potrzebowałem randomowe dane jako api, to w serwisie ktory pozwala tworzyc takie api, mozna skorzystac wlasnie z faker.js, wiec jest taka teoria ze czego sie nie dotkne to spierdole skoro usuneli zaraz po tym",
  "albo co to jest agregat",
  "albo czasami mozna natrafic na coś co jest typowo związane z tym jak działa system i się kmini o co chodzi",
  "albo fiuta drukuje czy cos innego",
  "albo jakakolwiek podobna technologia",
  "albo jakis polyfill czy cus dodatkowo do tego",
  "albo mozna bylo by to jakos przeformulowac",
  "albo pnpmy",
  "albo ta druga czesc naglowka \"made with\" moglaby na dol wleciec",
  "ale co czlowiek to opinia jak porownales sobie te dwie opcje na typy w javascripcie i wyszlo ci ze lepiej sie ts'a uzywa to uzywaj tsa",
  "ale co do czego z tym redisem, redis ma przechowywac jakies sugestie czy co",
  "ale co do czego",
  "ale cos nie chce mi sie wierzyc ze ktos jak robi pierwsze apki ze zna juz ternary operator",
  "ale czy będzie to dobre",
  "ale czy ja mowie ze to dobrze ze na jednych dziala?",
  "ale dzięki że zauważyliście co poniektórzy właśnie to , że się to rozjeżdza bo jak się skupi na dopracowaniu jednego widoku, to zapomina sie na innych",
  "ale fajna była",
  "ale gatsby chyba nie ma zadnego startera od buta z typescriptem, albo wydaje mi sie ze nie proponuja tego nowym uzytkownikom",
  "ale jaja",
  "ale jak chlop to any dal bo niewiedzial co ma zrobic to troche slabo",
  "ale jak dobrze mniemam typescript jakby to zalatwia sam w sobie",
  "ale ma model współbieżności,  szach mat ateiści",
  "ale musialbym zobaczyc w praktyce czy dzialalo to lepiej niz to co ja robilem",
  "ale nie ma darmowego jedzenia",
  "ale nie przesortujesz przez podział",
  "ale nie zaszkodzi? czy po prostu tak się nie robi albo się z tym nie spotkałeś?",
  "ale ogarniacie ze ja mowie o tworzeniu pierwszych projektów a nie o reactowcach juniorach wzwyz",
  "ale php umar, kor developer sie zwolnił",
  "ale przynajmniej syntax highliting jest",
  "ale strzała",
  "ale tak ogolnie to po co ktos wymyslil ten agregat jak to jest niby to samo co struktura",
  "ale ten był corem corów",
  "ale to twoje",
  "ale w react czy w ibm?",
  "ale wiadomo o czym mowimy, projekt dla szkoly, android puszczasz apke, ios trudno musicie zmienic telefon",
  "ale widze ze dosyc malo jest malo materialow na temat tego narzędzia",
  "ale z tym letem to dajcie spokój kto to słyszał",
  "ale zaraz sobie przypominasz że jesteś w młodzieży wszechpolskiej",
  "allegro korzysta w calosci z preacta czy na konkretnych stronach?",
  "ano jest w repo, ale chyba na nagraniu o niej nie mowil",
  "apropo background size to na malej wysokosci mam fallback z cover do zwyklego background",
  "apropo contextu, to tak sie robi czy nie ?",
  "apropo frontlive to ciekawią mnie te 2 style",
  "apropo npm\nhttps://www.npmjs.com/package/calendar",
  "apropo walidacji to mi sie takie podejscie podoba",
  "array from powinno byc prosciej bo dziala",
  "array slice",
  "Astro to po pierwsze jeszcze z wersji 0 nie wyszło",
  "astro",
  "autentyk, taka żenada że aż skręca",
  "backend i front w jednym",
  "backend oczywiscie elixir",
  "bardzo ładny czysty kod",
  "bardzo mnie to interesuje",
  "bawił się ktoś z plasmici'em i mógłļy powiedzieć czy warto jest zapoznać się z tym narzędziem?",
  "bawił się ktoś z tauri, albo próbował tworzyć własne środowiska frontowo-desktopowe?",
  "bo chodzilo wlasnie o wybór jakies algorytmu czyli czesci a nie calego obiektu",
  "bo czemu mialby ts nie wiedziec czy cos bedzie nullem czy undefined, brzmi troche sprzecznie z zalozeniem",
  "bo do tego jeszcze np. będę chciał komentarze dodać",
  "bo input htmlowy sam w sobie chyba nie ma zadnego api zeby wrzucic sugestie",
  "bo ja sam probuje dociec co to ma byc",
  "bo jak chcemy zmienic wyglad czyli naprzyklad przyciemnic pasek jak juz zjedziemy i sie bedzie trzymal u gory, to czego uzyjemy",
  "bo jak dodałem to jakby pomogło",
  "bo jak ja tak patrze, to wiadomo da sie przez state, chociaz moze trzeba to trochę przerobić i będzie bardziej pokomplikowane, a w moim przypadku to co ma dzialac dziala tak jak jest w zalozeniu i nie triggeruja sie zadne re-rendery, useffecty, czy w ogole to co sie dzieje po zmianie stanu czyli \"leciutko\" lepsza wydajnosc",
  "bo jak masz promisa to powinien byc chyba promise",
  "bo jak tego nie ma to height do okna jest chyba czy body nwm dokladnie",
  "bo jak zmienilem na klase abstrakcyjna to dobrze typy dzialaja",
  "bo jezeli tak to trzeba byloby wykminic jak sie pozbyc hydracji gdy nie ma interaktywnej strony",
  "bo kojarzę że to idzie przez ich serwery",
  "bo kolega pisal za ciebie?",
  "bo mi sie ta gwiazdka skojarzyła",
  "bo mialem to przez setinterval",
  "bo na roznych widokach uzywam background position zeby dopasowac sobie tlo",
  "bo najpierw jest jeszcze sprawdzane czy obrazek mozna z linku do artykułu wygenerować",
  "bo narazie jest Array<Object>",
  "bo nie jest akurat potrzebna, a wydaje mi sie  to na  lepsze rozwiązanie jezeli korzysta sie z jsxa",
  "bo nie umiesz uzywac to wymaga wprawy",
  "bo offtopic",
  "bo powinna byc nad tym kontrola wlasnie czy jest ten tryb cichy ze trzeba ucho przykladac czy glosnomowiacy i zeby mozna bylo slyszec na tyle ile telefon pozwala",
  "bo remix to jest lepsze php",
  "bo się przeciąża go",
  "bo string moglby byc kazdy",
  "bo ta zaleta ktora reklamuja to jest synchronizacja, jak oni to robią?",
  "bo tak mam obecnie to zrobione ze względu na to iż jeszcze nie wymyśliłem jak to skurczyć na mniejszym ekranie",
  "bo to co mam jak zgaduje, po prostu patrzy czy jsx i jak widzi ze tag to img to gra",
  "bo to jest ten qwiklabs, teraz znany jako skills boost",
  "bo to jest w stacku technologicznym",
  "bo to klasa abstrakcyjna powinna byc",
  "bo trzeba wiedzieć jak działają kąkutery bo później taki programista robi apke desktopową w elektronie na komputery z 32gb ramu",
  "bo w rn nie znam zadnej dzialajacej opcji chyba ze te worklety  sa czyms na ksztalt watkow",
  "bo w takim react native jak sie styluje to jest to mniej wiecej zbiezne z html",
  "bo w tym samym czasie pisalismy",
  "bo w zaleznosci gdzie co ma lezec mozna myslec jak to mozna zrobic, ja bym zrobil kategorię z większym tytułem i miniaturkami , i jedna kategoria pod druga",
  "bo w zasadzie tyle mi trzeba",
  "bo z docsow wynika ze partial to taki niezdecydowany undefined",
  "bo zamiast object no powinno byc cos do tego jakie to wlasciwosci i ze fielderror no ale to szczegol",
  "bon zasiedleniowy czy cos takiego",
  "bot ogarnie",
  "bugom niech będą dzięki",
  "było  --experimental ?",
  "cale zycie w bledzie",
  "caly sek w tym ze ja chce tylko ustawic checkboxy ktore normalnie lezaly by luzem",
  "chakra tylko cichutko przemyka",
  "chce miec klasę która będzie konfigurowalna przez drugą klasę, przykładowo jak masz klasę potwora i za pomocą klasy konfiguracyjnej decydujesz czy w funkcji atakuj będzie agresywny algorytm czy pasywny",
  "Chce zacząć przygodę z angularem, gdzie mógłbym zacząć i dlaczego mam tego nie robić?",
  "chcecie zobaczyc poziom studiów w polsce 😉 ?",
  "chciałbym zobaczyć działającą kolejkę przy pomocy tego, i również fajny ekwiwalent w javascripcie bo od tego zaczęliśmy",
  "chciałem sie dowiedziec czy jest jakis goto pakiet na npm, zeby nie pisac try catch a miec pewnosc ze jakiegos jsona mozna wygodnie odczytac",
  "chcieli algorytm wypisania \"korony\" drzewa binarnego",
  "chichot losu jest taki że osoba, która prowadziła te zajęcia już ich nie prowadzi",
  "chłop to zle robi co nie ?",
  "choc mozna by i to opakowac w biblioteczke jsowa",
  "chociaz i tak minimalnie sie korzysta",
  "chociaz mozna byloby miec cos takiego jak overlay i na nim linka, ale jak model sie rusza to trzeba byloby logike dorabiac do tego",
  "chociaz niekoniecznie",
  "chociaz undef chyba tez będzie, jak pola w ogole nie bedzie",
  "chodzi chyba o to, ze firma nie jest biedna i jest w stanie uczciwie zaplacic",
  "chodzi ci ze 2x lepiej?",
  "chodzi mi o kwestie z wyswietleniem",
  "chodzi o mediasoup",
  "chodzi o samo stosowanie takich praktyk",
  "chodzi o to , ze nie spotkaliscie sie z czyms takim?",
  "chodzi o to ze jest to metoda na uzyskanie referencji do obiektow wrzuconych przez props.children",
  "chodzi o to ze zainteresowałem się dzisiaj Remixem",
  "chodzi o to żeby było z tsem, ze stawia komponent i od razu interface",
  "chodzi o ts'a nie o negacje",
  "chodzi ze lepiej osobno trzymac?",
  "cholerka",
  "chy",
  "chyba dziwnie byloby jakby dzialalo to inaczej niz na mobilkach",
  "chyba jednak skorzystam z SSR w Astro ale jeszcze pomyślę czy będzie się szybko robić i będzie spoko",
  "chyba mozna tak powiedziec ale nie jestem pewien do konca",
  "chyba nie chodzi o to zeby bezmyslnie ustawiac",
  "chyba niedorozwuj",
  "chyba po prostu w fillu daje to co chce",
  "chyba remix będzie miał taki mechanizm do zarzadzania jsem",
  "chyba tak",
  "chyba wycina error czy cos takiego",
  "chyba za trudne",
  "chyba ze chodzi ci o zakres",
  "chyba ze rozwiazaniem mialoby byc wrzucenie tego do swojego repo",
  "chyba ze tego typeofa wywalamy i sprawdza sie przed zapodaniem do tej funkcji",
  "chyba zle funkcja byla wywolana bo obiekt undefined",
  "chyba zly typ zaproponowales a samo name defacto to powinien byc string po tym co wczesniej wrzucalem i przykladach a to co oni maja w tych typach odwalone to juz inna bajka",
  "ciekawe czy klepanie stronek w kolko rozni sie od siebie 😉",
  "ciekawe dlaczego",
  "ciezka sprawa ja bym uzyl remixa",
  "ciezko mi powiedziec, nie wiem czy rozumiem dobrze pytanie i w ogole to jak dziala biblioteka ale ogolnie content type powinien byc w kazdej prawidlowej odpowiedzi, ale to nie oznacza ze nie mozna dostac tej nieprawidlowej",
  "ciezko mowic ze community 2/10, bo tego community po prostu nie ma",
  "co do samego c, to wiadomo ze preferuje sie bardziej c++ ze wzgledu na oop, ja C stosuje jako skrot myslowy",
  "co mozna zrobic w takiej sytuacji jak ta po lewej? jest cos lepszego niz rozwiazanie z javascriptem zaproponowane tutaj https://css-tricks.com/the-trick-to-viewport-units-on-mobile/ ?",
  "co najmniej 3 godziny dziennie, nie masz samochodu i dojezdzasz rowerem, 3 godziny w 2 strony",
  "co nie oznacza że w c nie ma apek desktopowych",
  "co polecacie do nowego projektu, żeby było statycznie ale jednak server side rendering",
  "co prawda jest react native webrtc ale to nie dziala tak jak powinno i brakuje funkcjonalnosci",
  "co sądzicie o takiej implementacji checkboxa ustawiającego wszystkie checkboxy?",
  "co to jest pelnoprawne oop",
  "co to k*rwa jest strong junior",
  "co ty gadasz",
  "co ty, ja bym wolal dynamiczny zespol",
  "co z nim nie tak",
  "code coverage?",
  "Content-Disposition: attachment znałem, ale widze ze tez jest Content-Disposition: inline wiec moze tak sie da tym sterowac",
  "cos w ten desen powinno byc?",
  "cos wspominasz ze Partial odpada",
  "cv2 sie bawisz?",
  "cytując klasyka, ja tam wolę mieć kontrolę nad swoją apką",
  "czcionki widzę że są ładowane zwykłym tagiem w document, preferujesz takie rozwiazanie? z tego co wiem jeszcze mozna np. pobierac z npm i importowac w scss",
  "czego konkretnie nie umiem",
  "czej zobacze czy tak jest",
  "czekaj jeszcze raz przewine zeby nie bylo",
  "czemu nie moge na arrayu uzyc for of",
  "czemu nie, pytanie jaki experience dla uzytkownika przewidujemy",
  "czemu zdecydowaliście się programowac",
  "czesc funkcji bedzie sie powtarzac w projektach i trzeba bedzie i tak w kolko to samo pisac",
  "cześć koliedzy",
  "czesc",
  "czy 25",
  "czy chodzilo ci o c#",
  "czy cs_italy",
  "Czy dobrze byłoby skorzystać z position: sticky lub podobnych rozwiazan?",
  "czy mogloby byc tez analogicznie mozliwe że można stringa w tych klamerkach w przypadku obiektu czy tak to nie będzie działało",
  "Czy może być coś wspanialszego w naszej branży niż React?",
  "czy moze wszystkich caseow nie sprawdzilem i bedzie to samo",
  "czy mozemy po prostu nie chciec nawet optional",
  "czy nie jest tez tak, ze jak sa dodatkowe wlasciwosci w obiekcie to i tak jak sie wrzuci to komponent ktory ma tylko zdefiniowane propsy ktore sa czescia tych wlasciwosci powinien sobie i tak poradzic?",
  "czy np mozna sobie wpisac npm install i pojsc na 15 min przerwy i wrocic jak sie zainstaluje czy paczki trzeba w domu instalowac",
  "Czy pańska żona przestała się kurwić?",
  "czy po prostu nie ma dobrego wyjscia z tej sytuacji",
  "Czy przydaje wam się wiedza na temat programowania współbieżnego w pracy?",
  "czy react native jest taki natywny to polemizowałbym, chyba ze chodzi o wchodzenie w jakies szczegoly albo jak chce sie zrobic to czego jeszcze nikt nie wymyslil i trzeba zejsc do javy albo kotlina tudziez swifta",
  "czy samemu trzeba robic, czy jakis starter jest dobry np",
  "czy ten map jak cos niestandardowego będzie dodatkowo?",
  "czy tez pasowalby",
  "czy to jest tak ze jak sie robi projekt w next, to normalnie jest tak ze jest ssr z hydracją?",
  "Czy to prawda, że w software house'ach pracują młodsi niż 16 lat?",
  "czy umowa ramowa o dzieło to dobry pomysł w przypadku elastycznych godzin pracy?",
  "czy wlasnie masz element htmlowy ktory lapie pozycje 2d?",
  "czy za pomoca scrolla albo czegos innego",
  "czy że wyciska na siłce",
  "czyli emulator zawiódł?",
  "czyli i kamerka i glos przesylany",
  "czyli idąc wsparciem najlepiej będzie: media > picture > image-set",
  "czyli jakby jedna umowa zeby nie podpisywac osobno na kilka roznych zadan, ale tak jakby są to osobne zlecenia i się je przyjmuje do wykonania",
  "czyli mniej więcej dla was jest to taki złoty środek?",
  "czyli name dziala obecnie bez any?",
  "czyli nic przy zapodaniu w jsx, tylko jak sie przez przypadek odczyta",
  "czyli nie ma tam porownywania jakiegos?",
  "czyli powinienem moc jakos to zapisac bez podkreslenia",
  "czyli robisz sobie apke tak jak strone, czyli umiejetnosci ktore juz posiadasz i np. do jsa mozna dorobic sobie cos co mialoby cos w systemie konkretnie odpalic",
  "czyli to <fscript> nie obejmuje web workerow",
  "czyli w ogole react.fc po wypieprzac tam gdzie jest?",
  "czyli zalozmy ze ktos ma cichy mikrofon , to jest juz problem bo tak mozna byloby podbic troche a tak to nie ma jak",
  "czyli zeby ci strzalki automatycznie rysowalo?",
  "czym mozna zastapic glslify w nie nodowym srodowisku?",
  "czym testowac jak chce przetestowac symulacje",
  "czym wy sie tak ekscytujecie? 🙂",
  "da się zrobić coś takiego żeby z typu tablica czegoś, wyciągnąć element bez modyfikowania tego typu tj. osobno element i osobno tablica tego elementu?",
  "Da się zrobić w drugą stronę download-attachment a czy odwrotnie jest cos takiego?",
  "dałem es2017 wystarcyło",
  "de_aztec to jest taki artefakt w cs go",
  "de_tuscan ?",
  "dlatego wlasnie koles zopen-sourcowal zeby bylo wsparcie spolecznosci",
  "do czego jest ten ts-belt?",
  "do czego",
  "do gitów czy do frajerni",
  "do statycznego generowania stron",
  "dobra a umiecie mnożyć liczby w systemie binarnym?",
  "dobra ja nie wiem co tam sie kto uczy, ja sie po nowym nie spodziewam znajomosci takich wyrazen w kazdym razie, jak wy się tego nauczyliście na pierwszych lekcjach javascriptu to gratuluje",
  "dobra juz rozwial jakis developer moje watpliwosci",
  "dobra nie wpierdalaj sie, bo znowu zaczynasz",
  "dobra to na czym skonczylismy",
  "dobra wracając do tematu, odkąd dowiedziałem się że obiekt w javascript'ie jest wskaźnikiem moje życie stało się prostsze",
  "dobra zacznijmy od wymienienia przykładów gier funkcyjnych, bo mowa była o pokerze w react",
  "dobra zaraz wrzuce inny wariant, bo sie inaczej nie dogadamy, a skoro macie wiedzę to przynajmniej powiecie czy juz ok",
  "dobra, ale jakos sobie z tym poradze tak mi sie wydaje, jak juz zapodales ten kod, gorzej jest teraz z tym typem co na czerwono sie podswietla",
  "dobra, ja spadam jak nie potrafisz czytac to trudno",
  "dobra, konkrety z ktora rzecza?",
  "dobra, problem sie jakby sam rozwiązał",
  "dobrze to wygląda?",
  "dobrze ze jest ts",
  "dokładnie, nie wiadomo, to chyba trzeba odliczyć na ryczałt przez ipbox, ale prawnicy nie są zgodni",
  "dokturem to każdy chciałby być, a przetwarzać obrazów to ni ma komu",
  "domniemuje ze pewnie ten typ to nie tylko sam string",
  "domysl sie",
  "Drogi Kliencie, Panie Areczku Node 16 jest dla zaawansowanych użytkowników dla pana jest wersja 6 bez wsparcia",
  "dynamiczny kontent chce mieć na stronie",
  "dziadku to nie google",
  "dzięki przyda się, ale brakuje tam wyboru tego  co się chce wstawiać np. filename",
  "dzięki, o tą mi chodziło",
  "dzięki, to powinno być to, choć udało mi się to jakoś wyczaić sekundę przed tobą",
  "dziękuję, to powinno miec ogolnie zastosowanie do dokumentacji ktore mają też md pewnie",
  "eh coraz więcej amatorów pcha się do zabawy, przecież transkrypcja text-to-speech to coś co powinien znać każdy strong i less stronger junior",
  "eh, coraz więcej amatorów pcha się do zabawy, taki kod open-source wrzuca się do github copilota, kod się pierze i mozna go legalnie wykorzystywac",
  "enkapsulacja",
  "entry level",
  "ew. w Rust",
  "fajna stronka , ja bym nie ruszał 😉",
  "fake",
  "faker.js, to ten znany gracz ligi legend",
  "flex ci odpowie na pytanie jak zrobisz",
  "flutter ma w ogole multithreading?",
  "Flutter tez ma mozliwosc robienia na web, a sam w sobie może oferować nawet lepszą wydajnosc niz react native, ale Flutter dziala troche inaczej niz React Native, React Native kładzie nacisk na renderowanie z wykorzystaniem natywnych elementów, a Flutter po prostu rysuje na ekranie to co trzeba",
  "foreach to po prostu każdy, więc jak chcesz co drugi to musi byc jakis if albo przeskok o 2 tak jak w i+=2",
  "form odczytuje z checkboxow wartosci",
  "format png, wysokiej jakosci, malo kilobajtow, notujcie masterminda 😉",
  "frameworków też nie można uzywac?",
  "gdzie na poczatku musimy to miec w formie jakiegos obiektu",
  "gdzies rok temu sie chyba tym zajmowalem, wiec warto sobie przypomniec jak sie to odpala, bo nie jest to \"bezpieczne\" terytorium",
  "glownie intersuje mnie spsoob wykonania, czyli np. to jak Math.min skrociles",
  "glownie jak chce sie przeportowac apke desktopowa na web co prawda sie tego uzywa",
  "googiel cloud i tak best interface i nie rozjedzie sie na mobilkach",
  "googiel kazda litere wysyla jak pisze szybko",
  "gorzej z ta druga czescia typu",
  "gotowe consty z obrazkami, chcialem uzyc htmlimageelement ale on wymaga jakichś propsów",
  "haha , to ja bo mi sie layout rozjezdza, o ja nieszczesny",
  "halo administracja uzytkownik mi ubliza",
  "halo proszę używać poprawnej nomenklatury\npeople of dark, people of light",
  "halo pudliszki",
  "hmm cos tu smierdzi",
  "hmm probuje w ekspresie ustawic naglowek i nie idzie z sendFile, o co moze chodzic?",
  "hmm, ale jakby nie patrzeć to czego używamy w react to są klasy tylko inaczej nazwane",
  "http://hand-detection-wine.vercel.app",
  "https://babeljs.io/docs/en/babel-plugin-transform-remove-console/",
  "https://developers.google.com/web/updates/2017/09/sticky-headers",
  "https://github.com/microsoft/TypeScript/issues/24553",
  "https://stackoverflow.com/questions/49061774/how-to-build-a-typescript-class-constructor-with-object-defining-class-fields",
  "https://stackoverflow.com/questions/49941234/background-image-cover-broken-on-mobile",
  "https://streamable.com/75gtz1",
  "https://streamable.com/zmp5kn",
  "https://tsplay.dev/wOJzdW",
  "https://www.geeksforgeeks.org/abstract-data-types/",
  "https://www.youtube.com/watch?v=_a5j7KoflTs",
  "https://www.youtube.com/watch?v=43oPUJgocXM",
  "https://www.youtube.com/watch?v=b6qSGKN42Gc",
  "https://www.youtube.com/watch?v=gn7OJeOQgu8",
  "https://www.youtube.com/watch?v=XL6YeZC-Tlg",
  "https://youtu.be/Fk5KMOqORYw",
  "https://youtu.be/FQ6cXeB-0MI",
  "https://youtu.be/XKeN9WsUAzM?t=1260",
  "i byłoby to w takiej formie bez overlay'a, overlay to wtedy jak mamy prawdziwe tagi <a> wstawione",
  "i co , normalne są czy nie?",
  "i cyk pr closed",
  "i czy w ogole jest jakos wspierane",
  "i do tego webpack",
  "i dodatkowo trochę poniekąd wymusza znajomość systemu",
  "i dziala to tez z tego co kojarze tak ze blokuje watek jak sie osobnego watku nie zrobi, czyli jak z jsa odpale normalnie message boxa to powinno to blokowac egzekucje",
  "i headers w sendfile",
  "i jakie trudności napotykaliście",
  "i jakoś nie znam czegos takiego po srodku",
  "i ktore do czego sie nadaje",
  "i moge sie pozbyc pozycji wszystkich w zwiazku z tym",
  "i mogłoby się klikać żeby powiększyć",
  "i multisporta",
  "i na lewo tez 7 ok , 2 ok, 6 zaslonieta przez korzen",
  "i na takiej zasadzie to w skrocie dziala jak wyzej",
  "i nie co 2 3 znaki tylko delay",
  "i nie podswietla z kolei, przy uruchamianu jest blad",
  "I nie zaprzeczam że nie macie racji",
  "i obie są podobnej grubości",
  "i od klasy szablonowej w c++ też",
  "i ogolnie z racji ze jest to reactowy framework to nie ma tam problemu z wrzuceniem preacta?",
  "i otypowany",
  "i pewnie chodzilo o to ze wywolywalo sie ze stanem przed uruchomieniem konstruktora",
  "i potem resetuje sie i od nowa",
  "i potem taki bez studiów przychodzi do firmy i paciarzy",
  "i specjalnie to tego powstał react native cookies zeby moc cos modyfikowac w tym storze",
  "i tak ja go najpierw miałem zablokowanego, ale odblokowałem go, bo było mi żal .......\nżal nie zobaczyć jego merytorycznych odpowiedzi",
  "i tam z racji ze framework nawiazuje do starych metod webowych, a ktos inny zadawal pytanie w podobnej tematyce, postanowilem sprobowac zrobic taki przyklad",
  "i teraz jak masz moviedb, to mozesz wszystkie dane na raz sciagnac czy musisz po kolei?",
  "i tez niechodzi o to ze by mowic ze jest \"nieczytelne\" i tyle",
  "i to jest wlasnie na next?",
  "i to zdaje sie moze byc chyba undefined",
  "i trzeba przeładować",
  "i tu jest chyba ta korzysc z korzystania z tych technologii webowych, bo inaczej pewnie mialbys utrudnione korzystanie z takiego widgetu",
  "i tutaj nie zlapie tak od buta ze cos jest nie tak?",
  "i w e jest error",
  "i widze ze jest tam ten react-native-webrtc",
  "i z bootstrapa tez korzystaja",
  "i z poziomu samego js'a mialo to byc tak?",
  "i zabrakło konsekwencji bo \"l\" małe",
  "idealnie byloby jakby dzialalo to zeby bylo identycznie nie za malo parametrow nie za duzo",
  "if (process.env.DEBUG) console.log",
  "ile jest szybsze wyszukanie od dodania na biezaco",
  "Informatyka",
  "input type url",
  "ios to mozna miedzy ksiazki wlozyc w ogole z takimi malymi projektami albo open-source",
  "isc na gale freak to jak isc na kabaret a gale zawodowe to jak chodzic do teatru",
  "it/it",
  "ja byłem na rozmowie o prace i poległem na fizz buzie 😔",
  "ja bym na twoim miejscu skorzystal chyba z innego rozwiazania",
  "ja chce tylko zebys pokazal ze masz wiedzę a ty odrzucasz",
  "ja juz sam nie wiem z ktorego trybu to korzystalo ale po prostu nie sprawdzilo sie",
  "ja kasowałem od 50 do 100 zł za instalowanie pakietu office",
  "ja kiedys nie znalem",
  "ja moge zadac pytanie bo mnie ciekawi bo jest zarówno materialui jak i tailwind, będą te dwie paczki jakos koegzystowac?",
  "ja myślę żeby zainwestować w framework aurelia",
  "Ja na czarno robiłem z murzynem, tak zgadliście murzyn był od czarnej roboty",
  "ja na przyklad w swojej apce dodatkowo w kodzie z javy dodawalem androidowe chowanie się paska tego nawigacyjnego na dole",
  "ja np. tworząc w tym, dowiedziałem się, że okhttp3 ktory jest pod spodem odpowiedzialne za komunikacje http ma swoj taki store ktory sie nie resetuje sam z siebie",
  "ja powiem więcej żeby już zupełnie wyroznic sie na tle konkurencji zrob skrypt ktory zlokalizuje ten tekst we wszystkich dostepnych jezykach i wyeksportuje do svg, a nastepnie dodasz automatyczne wykrywanie jezyka uzytkownika w przegladarce ktore wyswietli odpowiedni obrazek",
  "ja rozumiem to tak ze requesty wpadaja i leci sobie licznik 10 sekund w tym przykladzie i jak juz jest 10 no to wlasnie pobiera te dane a czy wygeneruje to juz druga rzecz",
  "ja sie obawiam jakbym mial cos zrobic i bym sie zaciął w środku z czyms takim",
  "ja slyszalem taka opinie ze kiedys rzeczywiscie yarn byl lepszy od npm, ale npm poprawili i teraz dzialaja podobnie",
  "ja sobie tak z dupy tego typeof nie wziąłem, bo w przykładach tak samo jest to używane jako metoda do walidacji tego co przychodzi",
  "ja stosując ideologię HDD stosuje jednakowoż tailwinda",
  "ja teraz tak to astro rozkminiam ze chyba core'm zostane",
  "ja też się z Brooksem minąłem na klatce schodowej",
  "ja to tylko umiem iterować tablicę",
  "ja to tylko znam bo chyba kiedys mi edytor jakos to doklejal na rozwiazanie bledu",
  "ja to widze tak ze ten dodatkowy parametr, moglby byc wrzucany do othercomponent ktory by sie tym zajmowal, albo tak zeby tej funkcji stalo sie zadość dwa osobne othercomponentone i othercomponenttwo i one tylko biora dane ale juz bez tego boola ktory wybiera z tych dwoch",
  "ja uzylem jednak tego",
  "ja widzę, że 25k można u mnie",
  "ja wiem ze wordpress smieszny, ale nie postujcie bo mnie skręca",
  "ja zaczynałem od bycia script kiddie",
  "jak chce sie pisac w jsie to najlepiej, nie kazdy ma ochote uczyc sie specjalnie darta, reuzywalnosc kodu tez tutaj przemawia za tym",
  "jak chcemy miec klase konfiguracyjną",
  "jak chcemy się tego całkiem pozbyć",
  "jak chcesz np. gre zrobic to sie moze przydac, albo jakies fajne narzedzie",
  "jak chcesz tego uzyc",
  "jak cie bawi to idziesz siedziec za wspoludzial",
  "jak cos sie ma zjebac, jak ktos nie umie pisac, to prawda jest taka ze i nazywanie zmiennych nie pomoze",
  "jak dane trzeba laczyc to mozna byloby zastosowac fajny bajer, ale to na backendzie czyli ściągać na backendzie łączyć w jedno i cachować",
  "jak dodaje typy to pisze w typescripcie zgadza sie, jak mozna byc tak glupim to juz nie jest javascript",
  "jak dziala bez serwera, to będzie serverless",
  "jak kontent się dodaje",
  "jak korzystnie można zrobić pasek u góry strony, który byłby u góry strony ( position fixed ) i zeby rowniez zostal zachowany odpowiedni margines w zaleznosci od wysokosci tego paska?",
  "jak ktos ma jakis starszy lub np. jeszcze 7 zamiast 10 albo nieakutalizowal to wtedy tylko jest problem bo trzeba np. zrobic instalator ktory doinstaluje webview do systemu",
  "jak ktos wysle plik w requescie to go raczej nie powstrzymam",
  "jak mam uzyskac dostep do elementu",
  "jak masz obiekt mozesz zmienic wlasciwosci ale nie przypisac",
  "jak masz zwykły typ to nie możesz consta zmienic",
  "jak najlepiej zaincjalizowac tablicę, forem?",
  "jak nie, nie znam osoby ktora by nosila bucket i nie jarala",
  "jak nikt nie będzie uzywal to nie będzie community",
  "jak np. console.log zrobisz",
  "jak przeczytasz to powiedz czy rzeczywiście na poważnie",
  "jak przekazujemy wskaźnik do funkcji",
  "jak robicie readme na githubie, to macie jakies ciekawe narzedzia do tego zeby to ladnie i szybko to zrobic?",
  "jak robiles to od poczatku do konca to na pewno juz wiecej wiesz, ale lepiej zaczac moze z innym materialem albo oficjalnymi przykladami a pozniej to rozszerzac od zera",
  "Jak się nazywa rumuński roman?",
  "jak sie nazywala ta stronka z pytaniami tematycznymi kategoriami react , javascript etc. typowo rekrutacyjne",
  "jak sprawdzam z innymi tagami to wyłapuje tak jak trzeba i tylko img puszcza",
  "jak tak jest na ich stronie",
  "jak to chyba jakas praca magisterska",
  "jak to działa",
  "jak wrzucam errormessage do pierwszego kodu ktory tam jest na stronie w formie demo to nie podswietla",
  "jak wspomniałeś o C, to tu ktoś coś zaproponował ale raczej to juz jest nieczytelne\nhttps://stackoverflow.com/questions/10950828/simulation-of-templates-in-c-for-a-queue-data-type",
  "jakby elementy w pasku się na przykład z flex-wrapowaly i pasek sie stal szerszy",
  "jakby kogoś interesowało troszkę inne podejście, bez uzycia \"zbędnego\" klonowania elementów",
  "jakbym chcial robic tak jak tutoriale mówią to bym się nie pytał tutaj",
  "jakbym widzial to co masz na mysli to odnioslbym sie a tak to ciezko mi to sobie wyobrazic",
  "jaki stack bys wybral pod wlasnie taki chat zeby sie za szybko nie wywalil na przyslowiowy ryj",
  "jaki wordpress, jestes potencjalnie narazony na tysiace nieznalezionych luk",
  "jakie bmi?",
  "jakie ćwiczenia?",
  "Jakie najciekawsze aplikacje mobilne robiliście w React Native?",
  "jakie sa teraz stawki godzinowe dla frontend developerów?",
  "jakiś urzędnik na to patrzy, więc chyba chodzi o to żeby tego głupio nie robić, tylko odpowiednio uzasadnić",
  "januszex",
  "javascript masz w c++ i tak",
  "jedno z drugim nie stoi w sprzecznosci",
  "jedyne czym jeszcze moze byc oprocz stringa to plikiem",
  "jedynie mowicie ze nieczytelne i wam sie nie podoba, więc dobra kończymy , bo nic merytorycznie i tak nie odpowiecie szkoda strzępić, a i te przytyki co do wiedzy to tez fajne, skąd wiesz jaką mam wiedzę i doświadczenie w tym temacie, nwm. moze chodzi ci o to ze mam dac ref={checkbox1}, ref={checkbox2}, do kazdego i bedzie spoko czy jak?",
  "jedzenia",
  "jesli chodzi o tauri, to taka multiplatformowa alternatywa dla electrona, czyli wybierasz sobie framework i robisz apke desktopowa",
  "jest mozliwosc wprowadzenia swiezosci do ekipy",
  "jest na to jakiś pomysł, żeby to ts'em zalatwic? , bo mi nic nie przychodzi do głowy",
  "jest pytanie co to jest przyjaźń",
  "jest sobie wlasciwosc w inpucie checked, zgadza sie?",
  "Jest tam jakiś procesorek co wymyślił skrypt do kontroli zdalnych egzaminów\nhttps://jkob.fizyka.umk.pl/so+sk/ssctl",
  "jest tam taki mechanizm ktory pozwala sie pozbyc bundla tam gdzie nie trzeba?",
  "jest w jsie jakis trick zeby szybko zrobic ze element wiekszy od reszty w tablicy?",
  "jeszcze co do tego stylu, to widze ze jakby w tym cssie jest to powielone",
  "jeszcze jest jakis z wykrzyknikiem co nie wiem co oznacza",
  "jeszcze kwestia czy to jest jakos zalezne od uzywanej czcionki",
  "jeszcze mozna formsy w remixie robic moze, staroszkolną metodą",
  "Jeszcze można Remixa jako alternatywę do Nexta obecnie wybrać,\ntak Astro jest jeszcze w becie, a również można proponować swoje feature'y w postaci RFC, które mogą zostać ewentualnie wprowadzone, w każdym razie obecnie do każdej strony niedynamicznej w sam raz, co nie zmienia faktu ze  mozna sobie dodać jakiś dynamiczny komponent który będzie się komunikował z serwerem i zapewnic jakąś interaktywność (np. formularz kontaktowy czy coś innego), na pewno projekty tworzone na tym wykręcają bardzo dobre score'y w lighthouse, ale brakuje pewnych funkcji ktore mają większe frameworki jak np. ISR SSR , no i tez moze jakies gotowe komponenty typu Image, ale do tego akurat to juz są jakieś podejścia i można zerknąć na taki proponowany komponent tutaj https://github.com/RafidMuhymin/astro-image-demo\nIonica nie próbowałem, ale jeżeli jest to ekonomiczne ze względu na mniejszą problematyczność niż integracja z react-native to może być to dobry wybór moim zdaniem.\nJa natomiast lubię mieć natywne rozwiązania tam gdzie się da i próbowałbym korzystać z react-native-web, żeby współdzielić kod",
  "jeszcze nie dogadałem szczegółów, ale wezme to pod uwage bo ja z tymi stawkami troche jestem kilka lat do tylu, tak jak z javascriptem 😉",
  "jeszcze nie wymyslili takiej opcji , zeby bylo extra-strict?",
  "Jeszcze przy okazji jak rozwiązywałem drugi problem tym razem z \"background\" to okazuje się że jest problem na mobilnych przeglądarkach z obrazkami ktore maja za duze rozdzielczosci",
  "jeszcze radler junior",
  "jeszcze raz, co mi da to ze będą kontrolowane",
  "jeżeli chodzi o sam isValidElement nie wiem do końca czy był w tym konieczny ale wydaje mi się że typescript powinien to jakoś załatwić",
  "jezeli cos jest bardzo male to nie musisz od razu przenosic do innego pliku, tylko w obrębie jednego podzielić, ale można sobie też przyjąć taką zasadę, że jak coś już jest dłuższe niż jedna długość ekranu to można rodzielać, żeby nie męczyć scrolla",
  "jezeli mam inputy wklejone w ten sposob czyli tak jak w zwyklym html, to jak zrobic to mniej skomplikowanie, bo mi sie to ciezko widzi z wrzucaniem tego w stan",
  "jezeli nie ma zadnych przeciwskazan takiego rozwiazania, ze wzgledow wydajnosciowych czy cos to tylko tyle potrzebuje w zakresie tego pytania, taki byl mniej wiecej jego ogolny sens",
  "jezeli normalnie tego nie potrzebuje",
  "jezeli to rzeczywiscie jest tak jak u gory jakis wymysl prawnikow, to niezly bajer",
  "jsx zamienia kazdy tag na react.createlement i w moim przykladzie ten CheckBoxesParent nie ma innej wiedzy o inputach niz wlasnie to co jest w props.children",
  "JSX.element",
  "jutro idę się porekrutować, możecie mnie przetestować, jakiegos fizzbuzza mozecie zapodac",
  "każda",
  "kazdy kto ma leb",
  "każdy znał pytania zanim pojawił się test, także super studia, jest git dobrze , chłopaki robią i niech się niesie dobry przekaz",
  "keygen",
  "kiedy wejdziesz na kategorie \"software and game development\"",
  "kiedys mowili na mnie syn developera",
  "kiedys pamietam jak mialem czyjas drukarke w otoczeniu sieciowym i kliknąłem żeby cos sie wydrukowalo, jestem ciekaw czy poszło",
  "kiedys sobie zrobilem serwer w nodzie do drukarki, ze jest stronka wrzuca sie pdfa jpg cokolwiek i drukuje",
  "kij w te certyfikaty, wyrób sobie żółte papiery i każdy pracodawca cię zatrudni",
  "klasa dla porównania jest tylko, patrz na funkcję jaka piękna",
  "klasy spoko rzecz",
  "klepią, ale gdzie indziej",
  "kodu",
  "Kogos mi przypomina",
  "kojarzysz obiekt FormData?",
  "kompiluje toolchaina\ni jest taki problem, ktos sie spotkal z tym?",
  "konkrety",
  "korzystacie moze z jakiejs gotowej libki do bezpiecznego json.parse ?",
  "kruwa, coraz bardziej pojebane te rekrutacje",
  "ksiazka nie jest zła, dalej jest aktualna, gorzej jest z taką jedną co mam co jest pod node'a",
  "kto jest ten kolega grzesia, jakiś developer?",
  "kto nie robil nigdy apki desktopowej w c niech pierwszy rzuci kamien",
  "kto robił hand tracking?",
  "ktorego nie znam 😉",
  "ktory algorytm ma o logn",
  "ktory aspekt",
  "ktory autor",
  "ktory np. bedzie mial jakies metody decydujace, albo parsujace jakis config w pliku",
  "ktory powinien byc linkiem url do obrazka",
  "ktos mowil o bootcampie?",
  "ktoś robił responsywność w react native?",
  "kurcze a ja nawet ani tyle",
  "kurna noc jest kurna",
  "kwestia implementacji",
  "ładnie to wygląda",
  "ładny ten nowy design, na pewno trochę nowocześniejszy",
  "łaskawcy",
  "lecz ta druga ma mniej treści",
  "lekcja 1",
  "lubisz filmy trzymajace w napieciu?",
  "ma być to taki landing page",
  "Ma ktoś pomysł jak rozwiązać taki problem https://jsfiddle.net/7unq124g/11/ ?\ntło nie wypełnia całego obszaru na małych wysokościach",
  "macie jakieś fajne snippety do vs code, co by sie szybciej pisalo?",
  "macie jakis pomysl jak to ogarnac, zeby sie nie powtarzalo 2 razy?",
  "macie taki tranzystor i tam jest volt albo nie ma volta",
  "mam jedną z polecanych książek do C++ i  jedną dla początkujących w javascript",
  "mam nadzieje ze jednak wie",
  "mam taki div, tylko po prostu javascriptem jakims go modyfikowac?",
  "Mam za niedługo sprawdzian z klas jakieś rady ?",
  "margin-top to do ktorego elementu mialby byc, bo nie rozumiem zbytnio jak to mialoby dzialac",
  "masz coś takiego, to moze bys wrzucił , tylko ze na kanale #C",
  "masz domene?",
  "masz jakąś klasę do tego kalendarza?",
  "masz jeszcze for of i for in",
  "masz zaprojektowany design tego komponentu?",
  "mi sie np. tailwind podoba mozna cos szybko zrobic",
  "mi się wydaje że na prowadzących zajęcia. biorą ludzi z orzeczeniem czasami",
  "Mi się wydaję, że używanie Remixa, czy Nexta to trochę kwesia preferencji, z czym się lepiej pracuje, albo gdzie są jakieś konkretne zalety, póki co Next jest trochę dłużej i pewnie ma większe wsparcie niż świeższy Remix\n\nTak mogą być blogi, ale ogranicza cię tylko wyobraźnia, co w tym chcesz zrobić, no albo brakująca funkcjonalność.\n\nGeneralnie natywne aplikacje powinny działać lepiej niż nie-natywne odpowiedniki, a także zajmować mniej miejsca, ogólnie powinny sprawować się wydajniej. Można to sobie oczywiście samemu sprawdzić i porównać. Dla niektórych czasami jest ważne nawet to ile się apka odpala, bo to czy załaduje się w 5 sekund czy w 3, może zaważyć na odczuciu u odbiorcy.\n\nreact-native-web to taka przejściówka, żeby używać tych samych głównych komponentów co w react-native, nie jest to najprostsze rozwiązanie, bo czasami coś nie będzie działało tak jak na telefonie i trzeba to po prostu kontrolować, no ale jest przynajmniej nad czym myśleć, a apka robi się jednocześnie natywna i do przeglądarki",
  "mi to wygląda jak takie bieda b2b",
  "miałem jako tło taki duzy obrazek",
  "miales dobry pomysl z tym rozbijaniem",
  "mialo byc nieskonczonego",
  "minifikuj kod tam gdzie sie da",
  "mnie ktoś na rozmowie zapytał co to jest ts, to sobie tak pomyślałem czy probuje sprawdzic moją wiedzę, czy po prostu nie wie co to typescript",
  "moge bez problemu te pierwsze cztery uzywac przed |",
  "moge sprawdzic czy da rade, masz jakas konkretna wersje ktora moglbym sprawdzic?",
  "mógłbyś rozrysować tzn. napisać jak ty byś to widział na podstawie mojego kodu, mogę ci nawet wysłać to co ja napisałem i na szybko przerobisz",
  "mogliby co innego",
  "mówisz o funkcyjnym teraz?",
  "może bloga najpierw założę",
  "moze byc nawet context api",
  "moze figma",
  "moze funkcja zamawiania do bota?",
  "moze i nie ma sensu, jezeli przenosimy cala obsluge tych danych ktore przekazujemy do innego komponentu a to ma po prostu zwrocic liste tego komponentu z odpowiednimi propsami, mi się np. map mieni w oczach i bym sobie to dał obok i w mojej ocenie byłoby czytelniej",
  "może i są te paczki w jednym miejscu, ale raczej to samo da się osiągnąć korzystając z popularnych paczek na npm",
  "moze inni wyjasnia na zagranicznych forach",
  "Może ja bazuje po prostu na starych treściach",
  "moze jest jakis transformator bo bardziej takie rozwiązania sie stosuje",
  "może jeszcze dziś zgłębię ten temat, i się do tego odniosę jak to widzę, jak pisze vary to z przyzwyczajenia, chociaz tez czasami zdarza mi sie gdzieniegdzie schematycznie wrzucać lety czy consty, ale po prostu stan mojej wiedzy jest taki ze oczywiscie mają swoje zastosowania, ale nie są one kluczowe, w sumie to trochę jak z typescriptem niby wszyscy uzywaja juz teraz, ale nikt ci nie zabroni z czystego js'a korzystac",
  "moze lepiej byloby odpowiedzi przechowywac same w tablicy a pozniej im przydzielac litery?",
  "moze masz jakies stare node_modules gdzies globalnie albo w wyzszym folderze i cos sie pierdzieli?",
  "moze math.max",
  "moze nawet to będzie prędzej",
  "może nie do końca dobrze odtworzyłem sens wypowiedzi",
  "moze nie jestem na biezaco teraz praca jest legalna od 15 czy od 16",
  "może notacja tego typu ```b_ c_ ```",
  "moze pora zaczac tego uzywac",
  "moze robi ktos jakies backendy w c# , bo to takie popularne z tego co slyszalem?",
  "może się mylę, chętnie zapoznam się z waszą wiedzą, najlepiej na przykładzie listy jak by się to miało różnić w przypadku algebraic data type i abstract data type, ale to moze na innym kanale",
  "moze ta biblioteka jest tak przekombinowa ze sam edytor sobie z tym nie radzi",
  "moze tak byc?\n```js\nfunction detectLike(landmarks) {\n  const rest = landmarks.filter((_, index) => {\n    return index != 3 && index != 4;\n  });\n  const minOfRest = Math.min.apply(\n    Math,\n    rest.map(function (o) {\n      return o.y;\n    })\n  );\n  const l4 = landmarks[4];\n  const l3 = landmarks[3];\n  if (l4.y < l3.y && l3.y < minOfRest) {\n    const tilt = Math.abs(l3.x - l4.x) / Math.abs(l3.y - l4.y);\n    const result = tilt < 0.3;\n    if (result) {\n      alert(\"ok\");\n    }\n  }\n}\n```",
  "moze tak?",
  "moze ten typ cos tam zjebal",
  "moze to byc cos takiego nie kojarze jak sie nazywa ten wzorzec",
  "moze to po prostu trzeba wiedziec jak to sprawdzic odpowiednio, zeby nie podkreslalo",
  "moze trzeci raz napisze pytanie bylo czy cos sie zjebie z moim kodem czy moze byc , a nie czy jest dla was fajny i czy byscie tak napisali",
  "moze wymiencie, jakie algorytmy sortowania znacie",
  "moze zacznijmy od defaulta w next",
  "może zostać jsx.element, ale nie powinno cie o to prosić defaultowo",
  "moze zrobie sobie taki system w javascript",
  "możecie przestać?",
  "możesz oni i tak tego nie sprawdzają",
  "mozesz opowiedziec o tej apce elektron, sam ją zaproponowałeś czy jak to wyszło?",
  "możesz też nieczystym 😉",
  "możesz używać kiedy chcesz, stan jest jak coś trzeba renderować potrzebny",
  "można patrzeć https://github.com/Morritz/astro-blog-ssg",
  "mozna podpatrzec co robią duze firmy np, whatsapp zeby np. 2 miliony polaczen na jednym serwerze siedzialo",
  "mozna przekierowanie dodac",
  "można też na prawdziwym urządzeniu robić sobie preview, w moim przypadku to nawet lepiej działało niż ten emulator",
  "można też samemu stworzyc swoja apke przy pomocy webview w c++ i np. poprzez postmessage wywolywac z javascriptu kod natywny",
  "można wreszcie bez problemu robić klasy szablonowe",
  "musi wlecieć obiektówka bo inaczej człowiek sobie zęby zje",
  "musialbym sam na wlasne oczy zobaczyc jak to dziala, czy istnieja takie rozbieznosci",
  "musisz wiedziec o co chodzi i na pewno firmom nie chodzi zeby zatrudnic kogos kto na sztywno zakuł, tylko ze potrafisz jakis problem just in time rozwiazac",
  "MVC",
  "myslalem ze bede mogl uzyc React.Fragment do tego ref'a, ale nie da rady",
  "myslalem ze jak cos jest statyczne to jest statyczne, bo inaczej to taki bardzie server side rendering,\nmozna sie dowiedziec poprzez zdarzenia np.",
  "myslalem ze normalnie mozna tu pogadac, ale trudno",
  "myślałem, że ktoś powie solidjs",
  "na cos takiego wpadło, szkoda ze nikt sie tym nie zajmuje\nhttps://zeroserver.io/",
  "na czym ten blad polega",
  "na jednych się  rozjeżdża na drugich nie, zaraz to przejrze",
  "na module http samym pieknie dziala",
  "na pewno apka na web nie ma inaczej wygladac niz na mobilnym ekranie, tylko ze wieksza",
  "na pewno ma to sens zeby to jakos opakowac",
  "na poczatek nie chca mi nic dawac bardziej powaznych rzeczy tylko bardziej wewnetrzne mniej krytyczne rzeczy",
  "na remixie to robie",
  "na strumyku prawilnie",
  "na szczęście był przeciek pytań, i wiadomo czego się spodziewać",
  "na to się chyba mówi know-how",
  "na windowsie jest api, i mozna sobie zrobic wlasne natywne funkcje przy pomocy javascriptowego postmessage",
  "na windowsie uzywa webview, ktore na nowszych windowsach juz jest w systemie",
  "najbardziej popularny framework do webgl i najwięcej materiałów",
  "najciekawsze na pewno będą konferencje",
  "najgorsze w tych calych systemach, jest jak ktos chce zrobic gui, a do tego trzeba wspolpracowac z kartami graficznymi",
  "najlepiej chyba jest wlasnie jak najmniejsza jednostka bedzie przerabiala najwieksza mozliwa liczbe klientow",
  "najlepiej i tak się trzymać nowych wersji, bo w nodzie jakos nie ma chyba az takiego problemu z utrzymaniem wstecznej kompatybilnosci jezeli jest jakis starszy kod",
  "najlepiej to zapytac sie ile apek zrobiles i jakie problemy napotkales przy obu technologiach",
  "najlepiej znac Scalę, C, Javę, Typescripta",
  "najpierw masa potem masa?",
  "najpierw sie zapoznaj z ideą, bo czy niszowy czy nie nie ma to większego znaczenia",
  "najpierw sprawdza czy zmienna imageUrl to ciag znakow, a jaki to nie wazne bo verifyimageurl powinno rozwiac watpliwosci przy okazji sprawdzajac czy obrazek jest git bardziej niz patrzac na sam url, pozniej jak git to mozna go uzyc a jak nie to generuje się obrazek z linka do strony na podstawie innego pola i ta sama proba jest podjeta jak wiemy ze nie jest to ciag znakow",
  "najpierw zacznij od wyjasnienia mi co to jest ten path",
  "najwięksi programiści, sami mówią że nie znają języka na tyle dobrze",
  "name od errora jest zalezny",
  "name sie podswietla , a jak zabierze sie errors to juz nie",
  "name to Path<TFormValues> a jakiego typu potrzebuje errormessage",
  "native app dev to będzie raczej ta przystępniejsza ścieżka",
  "nawet cssa nie trzeba uzywac praktycznie jak nie robisz czegos specjalnego",
  "nawet możesz znaleźć coś podobnego do tego co chcesz np. przyklad gdzie jest jakis model ktory mozna obracac dookola",
  "nawet zdarzyło mi się dłubać przy kernelu windowsa",
  "nic sie nie modyfikuje i leci defaultowy case ktory jest w zmiennej u gorze od poczatku",
  "nie będzie pasowało do logiki, bo oczekujemy stringa",
  "nie będziemy się bawić w pozwy, będziemy się napierdalać",
  "nie bo później przychodzi skarbówka i idziesz do pierdla za okradanie państwa",
  "nie chodzi mi o subiektywna nieczytelnosc czy praktyki",
  "nie lubisz masła orzechowego ? a co ci po posnej kromce?",
  "nie ma jednej metody na zmienne, kazdy robi jak uwaza, ale to jest pierdoła w głównej mierze, bo przewaznie nie ma to większego znaczenia",
  "nie ma sensu dokladac sobie pracy, trzeba korzystac z gotowych rozwiazan",
  "nie ma tu zadnych punktow",
  "nie masz nieskonczonego ramu",
  "nie musicie banowac",
  "nie nie chodzi mi o pytanie, tylko po prostu ile sie da rzeczywiscie napisac",
  "nie nie słyszałem jeszcze o fscript, rozumie że to podobne narzędzie?\nWidziałem już jeden materiał o partytown i tam też była mowa o analyticsach, czy to są jakieś szczególnie problematyczne skrypty, czy po prostu najbardziej popularne z obciążających?",
  "nie no dam inny tytuł, bo będzie że plagiat",
  "nie no wiadomo że nie ma tak że każdy wie wszystko, ale mam takie przeczucie że to zadanie testuje co innego, a tym czyms innym jest umiejętność dopytania się o co chodzi i jak to ma dokładnie wyglądać",
  "nie no wystarczy",
  "nie odpowiedziałeś przypadkiem sobie?",
  "nie oplaca sie wstawac",
  "nie podal mi swojej oferty tylko zapytal sie ile chcialbym, i dodal tez ze pieniądze nie grają roli czy cos w tym stylu",
  "nie podswietla w klasie pochodnej",
  "nie potrzebuje nic poza rzeczywistem dom'em, react jest trochę z boku w tej sytuacji",
  "nie powiedzialbym populacja piekarzy zmniejsza sie https://www.money.pl/gospodarka/nie-pytajcie-dlaczego-pieczywo-zdrozalo-piekarnia-dostala-887-proc-podwyzki-taryfy-za-gaz-6723047932050400a.html",
  "nie przyda mi się taki widget",
  "nie rozumiem",
  "nie skompilujesz sobie starszych wersji , zeby nie uzywac rosetty?",
  "nie taki safe , a prototype pollution ?",
  "nie uwazam",
  "nie wiadomo co ty tam przekazujesz",
  "nie widze tam tego w skrocie co masz zrobic to wyluskac z tego stringa",
  "nie widze tego",
  "nie wiem co jest dla ciebie, nieczytelne, masz na mysli niezgodne z typową wiedzą nauczaną na bootcampach?",
  "nie wiem czy to jest jedyna rzecz ktora zaslynal, ale ponoc w rankingach mial wyniki lepsze od innych frameworków, co stawiałoby go w pozycji lepszego zamiennika dla reacta",
  "nie wiem do konca czy istnieje taki twór, dlatego szukam i czytam",
  "nie wiem jak można nazywać się programistą bez magistra z informatyki",
  "nie wiem jaką masz implementację, ale najprosciej jest spinnera wstawic przez stan isLoading jako bool",
  "nie wiem, nie odprawiał rytuałów przy mnie",
  "nie wyjdziesz z tego z twarzą, nawet nie próbuj",
  "nie wymyslili jeszcze biblioteki do maili czy nie chciales uzywac?",
  "nie, juz drugi raz się pytasz i nwm co to wnosi do dyskusji",
  "nie, moj blad jednak jak typ ma taki, to raczej tylko null",
  "nie, po prostu tak jest w przegladarkach ze trzeba to jakos dodac",
  "nie, to będą liście, chyba z tego co zrozumiałem korona nie jest w toku nauczania chyba zapodawana, i jest to wymyslone na potrzeby zadania",
  "nie, własna inwencja",
  "nie",
  "nieczytelne",
  "niekoniecznie, wystarczy, że zrobi się dużo obrazków, masę przykładów",
  "no a z kolei jak by nie bylo await i bylby ten promise no to trzeba byloby dac .catch",
  "no afera jest bo zrobili ranta i jakies pismo do prorektora ktos napisal",
  "no albo uzyc sticky o ktorym wspomnialem",
  "no ale co ci to da jak babcia nie zasponsoruje ci solidnej krytyki",
  "no ale co jest złego w tym przykładzie, w takim razie?",
  "no ale jak juz ma sie taki interface jak trzeba na drugiej stronie to jest bezpiecznie",
  "no ale mimo tego wprowadzili gender",
  "no ale tak czy siak mozesz zrobic to zadanie",
  "no ale wtedy to już loty narciarskie",
  "no chyba ze nextjs to w jednym \"projekcie\" mozna zrobic",
  "no i nie zapominajmy do zestawu jeszcze okulary słoneczne, saszetka",
  "no ja myślałem żeby po prostu zwrócić bo map sam w sobie powinien dawać tablicę",
  "no jakby bylo private to bylyby potrzebne",
  "no konstruktor",
  "no nwm czy to bedzie ok do tego, mi kalendarz do obiektowego pasuje",
  "no podstawy są proste, ale gorzej juz z bardziej zlozonymi rzeczami",
  "no raczej nie zfailuje ale nigdy nie wiadomo, jak uzywamy zewnetrznego endpointa",
  "no tak ale to zupelnie inaczej wtedy przebiega, bo daje inputy wsrodku funkcji parenta, a nie robie parenta i pozniej wpycham inputy",
  "no tak consty, tam gdzie się nie zmienia, to prawda",
  "no tak nie wiem co to jest",
  "no tak trzeba porobić klasy",
  "no tak, ale co mialoby byc inaczej?",
  "no tak, ja fluttera tez bym ruszyl jakby to cos przypominalo",
  "no tak, kazdy projekt ma swoje zasady i jak byloby nie uzywamy refow to byloby nie uzywamy refow i zrozumiale",
  "no tak, tylko kwestia jak to się zrobi, nawet sam input search moze dzialac tak ze wyszukuje ci na biezaco z api moviedb czy twojego serwera albo z tego co juz pobrales na stronie",
  "no tak",
  "no to 8 sprawdze",
  "no to code, visual studio bardziej pod c#, c++",
  "no to dodaj kropke",
  "no to git, i co next dziala sobie w tle i jakos odbiera ze cos nowego doszlo i przetwarza?",
  "no to mandat w takim razie",
  "no to moze jakas firma krzak",
  "no to musisz wstawic swoje fieldvalues jakos do tego",
  "no to wyglada normalnie, ale sprobuj wrzucic na jakas stronke codesandbox np. albo codepen to co ma dzialac i sprawdze",
  "no to znak zapytania powinieni pomoc czy nie, bo mi się nie pokazywało że jest już ok",
  "no widzisz namiszają w głowie i nic nie wiesz",
  "no właśnie ciężko, jedyne co jest git to że można sobie zrobić coś ala dziedziczenie na strukturach",
  "no wlasnie co typescript powie jak sie da wiecej niz trzeba, oto jest pytanie",
  "no wlasnie ja tu stare ksiazki czytam a wy od razu z grubej rury nowoczesny javascript i co tu sie dziwic ze tak mnie miazdzycie wiedzą",
  "no właśnie jest w klasach potrzebna znajomosc funktora",
  "no właśnie żeby to jakoś działało jak będzie się duzo tego tworzyc",
  "no, hatemele i cssy sa w drugim rendererze",
  "no, odkrywanie najlepsze",
  "noflaffjobs?",
  "normalnie mozna byloby wskaznik wrzucic, a w tym to nie wiadomo",
  "normalny pomysl",
  "np. glosnosci dzwieku",
  "np. macie ustawione 10 sekund, no to za max 10 sekund strona się odświeży",
  "np. tak https://jsfiddle.net/sf4kbzqg/1/",
  "npm i easy-json-parse , ez as that",
  "numberOflastDayOfCurrentMonth",
  "nwm czemu unia miałaby być problemem",
  "nwm czy dobrze rozumiem, ale czy chodzi ci tez o to ze zauwazyles ze niepotrzebnie jest to const props tworzone?",
  "nwm czy dobrze to nazwalem, ale chyba tak to jest jakos albo w specyfikacji albo tak sie robi",
  "nwm czy jakies media query probowac zastosowac czy jakies inne podejscie",
  "nwm dla czego, ekspert moze wyjasni",
  "nwm moze ktos zrobil to lepiej",
  "nwm po co sie do slowa przywala , synonim slowa infantylny to dziecinny",
  "nwm, probowalem dociec ale ta cala biblioteka jest jakas przekombinowana",
  "o jeszcze Olaf jest niemiły XD",
  "o tą chodzi dokładnie, jak ktoś jest początkujący to w sam raz",
  "o tym wlasnie mowilem, bo raczej nie ma takiej opcji zeby content mogl sam stwierdzic bez pomocy skryptu ile sie w dol przesunac",
  "o tym wspomnialem",
  "o varach też coś jest?",
  "obecnie dziala jako tako jak sie kciuk w gore pokaze do kamery",
  "obecnie moge, po prostu przepisalem przyklad minimalnie tak jak jest u mnie, troche z tym eksperymentowalem ale tak rzeczywiscie mozna to teraz wywalic wyzej",
  "Obecnie najlepiej stosować DDD Div Driven Development",
  "obiekty tam wsadzam, ktore domyslnie na poczatku beda takie same",
  "Obróceniu uległ każdy pixel obrazu",
  "Oceniasz zmiany obrazu\nWnioski: Po zastosowaniu obrót o 90 stopni, obraz obrócił się o 90 stopni, obraz jest obrócony",
  "oczywiscie ze jak juz przerabiasz to warto to tez poznac i cos w tym zrobic, no ale glowne zastosowania to jak cos trzeba zrobic wizualnego, a nie mozna tego zrobic latwo w htmlu samym, albo niekoniecznie chcemy",
  "od 12 jest formula na brew",
  "od czego to jest",
  "od kiedy context api implikuje globalnosc?",
  "od kiedy jest cos takiego",
  "od kiedy ta libka wlasciwie jest dostepna",
  "od ktorego wziales kod",
  "od razu są media query i mozna w jednej linijce ustawic jaki ma byc padding na small, medium , large",
  "ogólnie szopkę odwalą, naruszenie przepisów, skrypt w ogole jest tak zrobiony jakby security nie istniało",
  "ogolnie to tez moj edytor ma jakis problem albo ja cos zle robie, bo jakby nie chce przyjac do wiadomosci ze typ wyglada tak",
  "ok czyli spamuje w jakims intervale",
  "ok, czyli z tego co widze obecny stan jest taki ze wywalili --experimental, ale dalej trzeba konfigurowac zeby uzywac import",
  "ok, rozumiem o to mi chodzilo",
  "ok, ten fill musi byc tak?",
  "ok",
  "okolice compute engine",
  "Oktagon zweryfikuje. Będziesz klepał tak jak klepiesz swój marny kod",
  "one też się będą wyświetlać",
  "opcji jest duzo, wybierz to co najbardziej spelnia twoje oczekiwania",
  "osoby programujące",
  "otypuj to sobie bez templatki narazie",
  "paczka 0 dependencies, nie ma obaw",
  "panie areczku pieniądze są dla bezrobotnych, dla pana jest 3k na reke",
  "panie za moich czasów to już komputery wymyślili",
  "patrzę sobie właśnie na swój jakiś wcześniejszy kod i np. tutaj dałoby się oszczędzić",
  "patrzyłeś czy to fetchowanie z jsonem się nie spsuje?",
  "Personal Home Page",
  "pewka ( ͡° ͜ʖ ͡°)",
  "pierwsza rzecz jaka mi się nie podoba po rzuceniu okiem to ze to zdjęcie jest ściśnięte przy newsie",
  "piłka jest jedna a bramki są dwie",
  "Pixele doznały transformacji geometrycznej",
  "pnpm ma byc szybszy i od npm i od yarna",
  "pnpm, używacie?",
  "po dodaniu kontentu",
  "po owocach ich poznacie",
  "po prostu jak się rejestrujesz czekasz az request sie przetworzy i wstawiasz jakas indykację tego ze cos sie dzieje, dobrze mowie?",
  "po prostu jakos z tym nie jest nigdy po drodze",
  "po prostu potrzebuja szybko kogos do robienia, a tez chca zainwestowac zeby pozniej miec lojalnego pracownika",
  "po prostu robią to samo co w aplikacji mobilnej tylko ze w przegladarce",
  "po prostu w drugą stronę nic sie nie psuje",
  "po prostu wam mniej placa",
  "po prostu zeby sie szybko apka nie zapchala ma szybko dzialac",
  "pod płaszczykiem funkcji",
  "podejrzewam ze moze paczki są w ktorejs wersji nowszej zaktualizowane, ale z racji ze korzystasz ze starego noda, to one mogą mieć ustawione zeby tylko do nowszych nodów się instalować",
  "pojedynek na apki desktopowe w C",
  "póki co chyba najnizej na m1 mozna od buta uzywac node 12,\na jakby sie chcialo nizej to trzeba sobie samemu zaktualizowac zaleznosci",
  "poki co to nawet biore dwa pod uwage",
  "polecam się douczyć",
  "Pomijając to, że głównie uczę się tego co mi trzeba w danej sytuacji",
  "pomijajac ze mniejsze spamowanie niz za kazdym razem odczytywanie",
  "pomylka freudowska",
  "ponoć jest to spowodowane tym, że ...costamcostam nie jest traktowane jako object literal i nie da się typu sprawdzic",
  "pora na csa",
  "poradników w internecie jest na pęczki, ale mimo ze ta technologia jest maksymalnie przyjazna dla uzytkownika i pozwala cos szybko stworzyc, to nigdzie w necie nie da się znaleźć tutoriala opisującego jak zrobić komunikator głosowy",
  "porownuje dane zwracane z poprzednimi?",
  "position sticky wydaje się najrozsądniejszym rozwiązaniem, pytanie tylko jak ze wsparciem, ponoć 95% przeglądarek wspiera",
  "powiedzą żebym zrobił a-star algorithm i sie wyloze",
  "powiedział ten co nigdy z gotowca nie skorzystal",
  "powinna byc taka mozliwosc zeby uruchamiac js w osobnym watku, jest nawet biblioteka ktorej probowalem uzywac, no tylko jest do dupy crashuje sie i od tamtej pory nikt nic tam nie zmienial",
  "powinno byc ok, ale chyba dalej cos chyba trzeba dodac jak nie bedzie stringiem imageUrl bo jest opcjonalny",
  "poza tym jaka jest roznica uzyc npm i paczka_ktora_ktos_zrobil,\na wrzucac to do utilsow tylko ze wlasnorecznie zrobione",
  "prawdopodobnie to co mam teraz private będę odczytywał więc chyba nie ma sensu robic private",
  "problem jest jak chcesz templatki uzyc u gory masz ok rozwiazanie",
  "problemow z kodem",
  "probowalem i res.set",
  "probowalem zrobic podobny przyklad i nic nie podswietla",
  "probowales to wywalic po prostu bo chyba nie pytalem?",
  "probuje jeszcze to uproscic, ale widzę ze ciężko, bo z tego co widzę to juz nie bardzo da się dokleić np. ref'a po tym jak element został \"zReact.createElementowany\"",
  "próbuję to ogarnąć, tylko trochę mi się to miesza i nie wiem czy to samo mamy na myśli, spróbuję zrobić w taki sposób do ktorego mialem watpliwosci",
  "próbuje znalezc jakas wzmianke o tym",
  "propozycję",
  "propsy chcesz miec do dwoch rzeczy na raz?",
  "przeciez try { } catch(e)",
  "przeszło płynnie od webassembly tak jak tematy w wiadomosciach tvp",
  "przetwarzam zestaw landmarkow z modelu ml  zeby wykrywac gesty",
  "przydaje się to do czegoś, testowałeś?",
  "przydatne w kanalach typu help",
  "przykład",
  "przypomniałem sobie ze na stronie mojej pierwszej szkoly kiedys w galeri zdjec byl taki myk ze jak ktos chcial prawy przycisk myszy to copyright warning sie zalaczal",
  "pubsub",
  "pytanie co dluzej zajmuje czy napisanie % 2 - 2 znakow, czy npm i is-odd czyli znacznie wiecej",
  "pytanie czy ma to jakies duze znaczenie syntaktyczne",
  "pytanie jak to wyglada, bo mi sie nasunelo ze moze flatlista?",
  "raczej superstring nie powinien byc 0 jezeli zalozymy ze ma byc to po prostu string, chodzilo mi tylko o ten case ktory zawsze będzie jak prop jest opcjonalny",
  "react 16.14 to ktory rok",
  "reacta by uczyli a nie",
  "Reacta tez mozna wlasnego napisac",
  "refy",
  "remix już się przejadł czas na coś nowego",
  "robiles juz o tym moze artykul?",
  "robisz strone przepisy siostry anastazji, a tu komentarze z githuba",
  "rowniez mozesz w edytorze najechac na to i ci powie jaki typ jest zinferowany od tego name i o co mu chodzi",
  "rozgryźliście wykładam programowanie na wyzszej szkole informatyki i zarzadzania",
  "rozni sie jedna wartosc",
  "rozumiem ze ten serwer discordowy jest scisle pod frontend?",
  "rozwiązać to możemy tylko w jeden sposób",
  "runtime.js",
  "rzeczywiscie jest tak ze ta funkcja object.entries[...] działa i wszystko hula bez błędu, ale gdzies wyczytalem ze to react powinien jakis blad wywalic",
  "rzeczywiscie nikt nad tym juz nie pracuje",
  "są klasy",
  "sam wychodze",
  "scala tak średnio, java też mi nie podchodzi",
  "sejfy pe el",
  "semantyczny to chodzi o to ze nav powinien byc i te inne, dobrze kminie?",
  "senior bootcamp developerzy",
  "settery chyba jeszcze mają sens bo można w nich jakieś błędy wykrywac",
  "słowa public private protected readonly",
  "słowo klucz w większym",
  "Słyszeliście o aferze na UMK?",
  "sprobuj errors dac object",
  "sprobuj to wrzucic na jakis codesandbox",
  "STAN JEST ASYNCHRONICZNY!!!!",
  "stawka tak na 80% junior frontend developer 20% bugów",
  "StrategyA nie widzi trzeciego, wiec jest taka troche niescislosc",
  "studenty to takie debile, że nie potrafią usunąć elementu z double linked listy i musiałem ich upierdolić na 1 roku",
  "styka, nie kojarzylem tego operatora",
  "Styl Bazowy: FlexBox",
  "super, zapamiętam sobie",
  "swappu swappu",
  "święte C najlepszy język na świecei",
  "szalone, ze w tylu projektach sie tym developerom nie chcialo tego pisac , niewiarygodne",
  "szukacie strong juniorów?",
  "szukales moze jakichs opcji skrocenia kodu do animacji z framer motion?",
  "Szukam rozwiązania poniższego problemu:\nflex z 3 divami\n1. rozmiar taki jak content\n2. obrazek ze sztywnymi rozmiarami\n3. text ktory gdy wyjdzie poza miejsce zamieni koniec na trzy kropki i nie rozwali calego ukladu\nCzy poniższe rozwiązanie ma sens, czy dałoby się to jakoś uprościć?\nhttps://play.tailwindcss.com/Y5Z5GPevZ5",
  "szybko, sprawnie",
  "ta funkcja jest do wszystkich więc, trzeba byłoby jakąś abstrakcję zrobić albo użyć czegoś innego?",
  "ta paczka z jsonem ma to w dependency probuje rozkminic o co z tym chodzi",
  "tak , wszystkie podzbiory",
  "tak co to jest za zastosowanie, bo nie spotkałem się żeby 3 wartosci ustawiac, jaki to efekt daje, i czemu styl jest oblique i czy jest to jakas roznica od zwyklego italic wlasciwie",
  "tak dokładnie, a w wolnym czasie uwielbiam jeździć na rowerze",
  "tak jak na szybko rzucilem okiem to wygląda to na niedokończone",
  "tak jak wspomniał kolega u góry to template, i wydaje mi sie ze jak juz  to nie FieldErrors<LoginFormFields | ContactFormFields> tylko FieldErrors<LoginFormFields> | FieldErrors<ContactFormFields> , ale nie jestem pewien",
  "tak klasycznie, bo z gitem też jest dobre rozwiązanie, ale bardziej tak jak jest frontlive",
  "tak lista id",
  "tak mozna o kazdym powiedziec, uwazacie ze wszystko wiecie?",
  "tak na refactoring.guru przedstawiaja przykladowy kod\n```ts\n/**\n * The Context defines the interface of interest to clients.\n */\nclass Context {\n    /**\n     * @type {Strategy} The Context maintains a reference to one of the Strategy\n     * objects. The Context does not know the concrete class of a strategy. It\n     * should work with all strategies via the Strategy interface.\n     */\n    private strategy: Strategy;\n\n    /**\n     * Usually, the Context accepts a strategy through the constructor, but also\n     * provides a setter to change it at runtime.\n     */\n    constructor(strategy: Strategy) {\n        this.strategy = strategy;\n    }\n\n    /**\n     * Usually, the Context allows replacing a Strategy object at runtime.\n     */\n    public setStrategy(strategy: Strategy) {\n        this.strategy = strategy;\n    }\n\n    /**\n     * The Context delegates some work to the Strategy object instead of\n     * implementing multiple versions of the algorithm on its own.\n     */\n    public doSomeBusinessLogic(): void {\n        // ...\n\n        console.log('Context: Sorting data using the strategy (not sure how it\\'ll do it)');\n        const result = this.strategy.doAlgorithm(['a', 'b', 'c', 'd', 'e']);\n        console.log(result.join(','));\n\n        // ...\n    }\n}\n\n/**\n * The Strategy interface declares operations common to all supported versions\n * of some algorithm.\n *\n * The Context uses this interface to call the algorithm defined by Concrete\n * Strategies.\n */\ninterface Strategy {\n    doAlgorithm(data: string[]): string[];\n}\n\n/**\n * Concrete Strategies implement the algorithm while following the base Strategy\n * interface. The interface makes them interchangeable in the Context.\n */\nclass ConcreteStrategyA implements Strategy {\n    public doAlgorithm(data: string[]): string[] {\n        return data.sort();\n    }\n}\n\nclass ConcreteStrategyB implements Strategy {\n    public doAlgorithm(data: string[]): string[] {\n        return data.reverse();\n    }\n}\n```",
  "tak na serio, to się wszystkim zajmuje co mnie interesuje i co jest mi potrzebne, chce zrobić sobie wykres to sobie szukam z czego zrobić i go robie np.",
  "tak na szybko, join modyfikuje, a map tworzy nową?",
  "tak o to chodziło, tylko nie jestem w stanie ci powiedzieć, czy to jest w 100% dobrze, ale mam nadzieję , że sobie to jakoś sprawdziłeś, w sensie czy w tym bloku catch zarówno łapie fetcha i jsona,",
  "tak od 6000 wzwyz",
  "tak ogólnie to my tu jesteśmy opłaceni i robimy za sztuczny tłum także zawsze ktos odpowie",
  "tak rust jest bezpieczniejszy, ale c jest latwiej ogarnac",
  "tak rzuciłem, ale ogólnie boty mogą tworzyc wątki i nimi zarządzać",
  "tak sprawdzona ze facebook musial ja sobie przerabiac",
  "tak tez mozna, ale z klasami w ts nie mam do czynienia zbytnio, ale przyda sie, bo dzis chce akurat zaczac jedno zadanko obiektowe",
  "tak też zrobiłem, na bazie dwóch, które były nie takie jak chciałem, ale wydaje mi się że warto się nauczyć kiedyś tego syntaxu żeby sobie tworzyć właśnie samemu snippety na poczekaniu",
  "tak to zrobilem ostatecznie",
  "Tak znam od dawna, ale jak chyba pierwszy raz probowalem to bylo zjebane, ale za jakis czas znowu sprobowalem i juz dziala",
  "tak, choc jak wiadomo te typy zmiennych w javascripcie to w duzej mierze taki pic na wodę",
  "tak, dlatego mi sie to podoba bo powtarzajace sie node_modules to jest jednak slabe jak ma sie malo miejsca na dysku",
  "tak, ktoś mi oferuje pracę i próbuję znaleźć jakie są mniej więcej widełki dla kogoś takiego jak ja co jeszcze nie był juniorem, bo za malo zarabiac to panszczyzna, a za duzo to sie nie nalezy",
  "tak, to taka twarz reacta, troche niektorzy go nawet mylą że jest twórcą",
  "tak, w mojej ocenie ma szansę się rozwinąć, choć narazie trochę słabo z możliwościami i zdarzają się błędy, a sam developer experience trochę odbiega od tworzenia w standardowych frameworkach js'owych, ale nie jest to jakaś wielka przeszkoda\nNa pewno jest to świetny wybór pod strony statyczne, jest tam zastosowane podejście no-javascript, czyli sami decydujemy kiedy chcemy coś ożywić na naszej stronie, a co nie, czyli wrzucając przykładowy komponent reactowy na stronę jest on wyrenderowany w stanie pierwotnym, a jak chcemy zeby korzystal z javascripta musimy dodac odpowiednia dyrektywe",
  "tak",
  "taka wlasciwosc w html",
  "taki bieda rootkit",
  "taki trywialny przykład, jak chcemy w rn policzyć fibonacciego i nie blokować np. klikania w ui, to po prostu asynchronicznie powinno wystarczyć?",
  "takie porownanie",
  "takie pytanko, jak mielibyscie robic inputa z podpowiedziami tak po prostu w react'ie bez zadnej biblioteki, to oczywiscie wiadomo, ze trzeba na froncie zrobic zabezpieczenie przed spamowaniem backendu, ale jak byscie podeszli do kwestii wyswietlenia tych podpowiedzi w formie listy?",
  "takiego",
  "także jest nisza na rynku, ni ma rąk do pracy",
  "tam chyba ten etag cos blokuje",
  "tam jest chyba cos takiego jak varianty, moze by to pomoglo",
  "tam to widać dezaktualizację",
  "tam w gatsbym robią głównie stronki",
  "te buckety, to ci co palą zioło noszą co nie",
  "te uczelnie to w sumie debilizm z dwoch stron, z jednej prowadzący co odstawiają manianę",
  "temat: jak wlaczyc komputer?",
  "ten css to jest na zapas?",
  "ten drugi jest mi znany",
  "ten typ to jakis generator chyba robil",
  "teraz jak zdalne to w wordzie",
  "teraz to chyba tylko mi trzeba html css for beginners tutorial i mozna pracowac",
  "teraz to trzeba wstawiać tupla z zaimkami",
  "teraz tylko znalezc ktora to paczka ma tego jednolinijkowca",
  "text/plain mozna",
  "też ale to jest alternatywa napisana w ruscie",
  "tez mogloby byc to rozwiazanie",
  "też proponowałbym, żeby jak coś jest specyficzne, aby zaznaczać czy praktyka jaką proponujecie odnosi się stricte do reacta, czy też do node'a",
  "tez sie tak zastanawiam, jak mam jakies stare repa i nie ma tam package.json, bylo cos takiego ze sie kiedys nie tworzylo sie to jak sie np. nie zrobilo npm init ?",
  "tez uwielbiam interfacy",
  "też warto, <@!287907520624984064> masz na myśli żeby tylko to co jest w środku map'a wynieść, czy też tego mapa z enkapsulować można w jakąś funkcję typu \"generatePostLink\" ?",
  "ThreeJS, bo sam WebGL jest bardziej dla zaawansowanych, i od razu masz tam tą abstrakcję dotyczącą obiektu",
  "to 20/h bedzie git?",
  "to będzie jakieś T extends?",
  "to będzie to pewnie https://www.geeksforgeeks.org/print-nodes-top-view-binary-tree/",
  "to chyba będzie factory tak mi sie wydaje albo cos bardzo przypominajacego",
  "to chyba troskliwe misie powinny wiedzieć",
  "to chyba wywołanie szybsze będzie co nie",
  "to co podales teraz jest chyba jasne",
  "to co zakładamy multi bilion dollar unicorn company that will go to the moon?",
  "to czyjs kod akurat",
  "to do zadania jest potrzebne",
  "to fajnie, widze tylko ze glowna domena jest pusta",
  "to ile taka jedna tania instancja powinna wytrzymac na raz",
  "to jak masz to mozesz zrobic tekstem",
  "to jak to sie robi z i+= 2",
  "to jakiś packer musi się tym zająć",
  "to jeden obiekt",
  "to jest az tak infantylny przyklad ze ciezko tu mowic o gotowym rozwiązaniu",
  "to jest male piwo, tu trzeba rozkminic cala strukture, mysle teraz jak przekazac stan w dol bo bede mial klase ktora bedzie miala wektor obiektow i ustawienia, ktore z kolei chcialbym zeby byly dostepne w tych obiektach",
  "to jest skrypt do zainstalowania na urządzeniach uczniów",
  "to jest ten przykład wlasnie o ktorym mowilismy? to samo sie tyczy spread operatora?",
  "to jest tez np. duzy kontrast czyli strona żolto-czarna?",
  "to jest z jsa? generator czy cos takiego?",
  "to juz w paczce ktora bedzie miala to w dependencies",
  "to kiedy moze sie to okazac niebezpieczne?",
  "to logo z daleka wyglada jak arabskie pismo",
  "to miałby staż, ale jeżeli miałbym to nazwać to powinien byc to \"software engineer\"",
  "to może chłop sam nie wie, jak go pytałem jaka to jest to mówił że dzieło",
  "to mozesz sprobowac to zmienic",
  "to nawet nie jest on",
  "to niezle any to po co as w takim razie",
  "to nwm jak to dziala, musialbys mi to rozrysowac",
  "to pewnie najlepsze rozwiązanie",
  "to pewnie nie bez przyczyny taki kapelusz trochę pozwala ukryć czerwone oczy",
  "to są jakieś konkretne paczki?",
  "to się dobrze składa bo na nich się wzoruje",
  "to się nazywa \"exact types\" i flow to ma",
  "to tak jak w skokach jedni wolą małe skocznie drudzy skakać na mamucie",
  "to ten image-set jest taki ready to go, czy jeszcze nie do konca wprowadzony, bo chyba z tej trojki najswiezszy",
  "to ten wykrzyknik powinien byc uzywany?, jezeli to jest do oznaczania ze cos nie bedzie nullem ani undefined",
  "to też fajne pytanie, iluoperandowy jest operator []",
  "to to nie jest to samo xd?",
  "to trzeba cos przerobic chyba, typ zmienic?\nbo jak ma ze typ zwracajacy to promise to po await juz nie będzie promisa",
  "to w kwestii tego",
  "to w ogolnym ksztalcie mialby byc taki cms ze mam panel i tam sobie dodaje posta i on od razu ma byc na stronie",
  "to w sumie mniej wiecej o tym byla mowa",
  "to ze sie rozjezdza to przyznalem, tylko niektore devicey pokazuja inaczej, w tym moj telefon prawdziwy",
  "to znaczy jezeli nie mam zadnej interaktywnosci zwiazanej z polami ktora wymagalaby byc moze wlasnie posiadania kontroli poprzez stan, to sa jakies korzysci z tego?",
  "to znaczy?",
  "to zrobilem jakos tak ze template typescript z react native init",
  "trochę już poprawione, ale ta sugestia z wywaleniem funkcji do innego pliku, trochę trudniejsza do zrealizowania w ładny sposób ze względu na przeszkody techniczne w xelemencie, ale jeszcze pracujemy nad rozwiązaniem, może w web componencie dałoby radę zaimportować bez problemów",
  "troche patowa sytuacja bo ja bym sobie to musial zforkowac i przerabiac",
  "troche tez bloat jest mniejszy, bo w electronie na dzien dobry jest jakies 100 mb",
  "trzeba jakoś zarządzać, jak zrobisz sobie kolejkę czegoś w js, to chyba tak najlepiej żeby się nie pomieszało",
  "trzeba omówić poważnie temat, bo 99% seniorów nie wie że istnieje coś takiego jak private fields",
  "trzeba policzyć czas wykonania operacji",
  "trzymaj stan maksymalnie blisko jak się da",
  "tu chłop dobrze pisze",
  "tu chyba foto tego rzekomego developera php",
  "tu jest ciekawe artykul na ten temat",
  "tu jest kanal random nie reactowy",
  "tu sa wszystkie propozycje",
  "tuscan tez italy",
  "ty ale oni glupi",
  "ty tak",
  "ty tez sprawiasz, ale się nie czepiam ciebie",
  "ty z kims pracujesz czy samozatrudniony?",
  "tylko jakis mechanizm musi na to pozwalac",
  "tylko jeszcze trzeba zrozumiec o co chodzi z tym nullem, mam go do typu dac?",
  "tylko myslalem zeby im id dopisac jakies",
  "tylko na poczatku zeby nie duplikowac nic nie ma",
  "tylko nie ma zadnego interfejsu do dostosowywania czegokolwiek",
  "tylko pytanie co się bardziej nada, bo tekst się tak dobrze nie skaluje jak obrazek",
  "tylko tailwind",
  "tylko trzeba umić",
  "tylko trzeba wiedziec jak uzywac, zeby sie nie zaplatac",
  "tylko wlasny software",
  "tylko ze na malej wysokosci to tlo jakby zostawia biale pole",
  "tylko ze pojęcie zaczynające się od algebraic jest do funkcyjnego",
  "tylko ze to ma byc z pliku tak?",
  "tylko ze to po prostu bylby node tylko ze bez systemu",
  "tylko ze to w konfiguratorze",
  "tylko ze to w srodku zamiast tych i !== , zgadza sie?",
  "tylko ze w samym tytule jest mowa o swiadczeniu uslug, wiec troche tu sie wszystko wymija",
  "tylko ze zamiast kazdy parametr osobno",
  "typ na typie typem pogania",
  "typ robi ranta, bo paczki są podatne na błędy tylko, że akurat nie w jego przeglądarkowym środowisku, tak ?",
  "TypeofWeb Copy Pasting Driven Development w skrócie TCPDD - Podcast #6 -\nCzy developerzy idą w dobrą stronę czy może nie?",
  "typeofweb",
  "typescripta chyba tez nie znają, ale sie okaze jeszcze",
  "typu artykuły na stronie",
  "u góry mamy niepoprawny kod",
  "u mnie jest statyczne",
  "ubiegli mnie",
  "udalo mi sie stworzyc prosta appke ktora wlasnie przez webrtc i przy uzyciu tej biblioteki sie laczyla",
  "uniwersytet mikołaja kopernika w toruniu",
  "ustawmy sie wiekiem",
  "utrwalila mi sie taka opinia ze gatsby = stronka landing page, portfolio , nextjs = wszystko inne",
  "używacie deno i dlaczego tak ?",
  "uzywacie, commitizen i husky ?",
  "uzywales?",
  "virustotal.com",
  "vw jako fontsize czy jak",
  "w c# robią ludzie systemy to czemu nie w javascript",
  "w figmie sa takie gotowce ktore tam maja takie elementy i mozna z nich sprobowac cos skladac,  ale w sumie zapodales ciekawy pomysl, zeby zrobic cos takiego jezeli nie ma czegos takiego jeszcze",
  "w interface przykladowo dodaje jeden dodatkowy, a w tym co go implementuje nie ma",
  "w jsie funkcje generujące są z gwiazdką",
  "w każdym razie zaczynam pisać książkę \"Klasy w javascript, czyli OOP na poważnie\"",
  "w moim przypadku proponowana jest ramowa umowa czyli na więcej niz jedno \"zadanie\" i z tego co widzialem to byloby to w formie osobnych tasków, do ktorych jest sie przypisanym",
  "w ogóle da się w tym expo kompilować lokalnie?",
  "w ogóle kiedyś to było nie to co teraz",
  "w ogóle najlepszy wynalazek to i tak typescript",
  "w ogole przerabane jest teraz znalezc jakas fajna templatke zeby od razu z web dzialalo",
  "w ogole pytanie czy jest sens sie bawic w jakies gettery",
  "w ogóle raz robiłem sobie pentesta isp u mnie",
  "w ogóle umiecie przesortować kopiec?",
  "w ogóle w twoim przykładzie dane mają być co jakiś czas aktualizowane? bo można wtedy to zrobić na kilka sposobów",
  "w remixie jest hook useShouldHydrate",
  "w RN jest tylko problematycznie jak cos chce sie robic niestandardowego w mojej opinii",
  "w sensie ze widget jest od nich, tylko styl dopasowany",
  "w sensie zero javascript tam gdzie sie da, tak jak astro",
  "w sensie, ze juz na tyle umiesz?",
  "w sieci jest jakies 100 routerow",
  "w skrocie jest to taki embeddowalny ms edge",
  "w sumie nawet w c",
  "w sumie tez sie zastanawiam jak jedna funkcja w drugiej funkcji jest nieczytelna i to jeszcze typowo reactowe",
  "w sumie to raczej standard, bardziej to drugie jest wazne, ale jak aplikacja to tylko przykład, to moze sie wykrzaczyc",
  "w takim razie jak nie chcemy zrobić czegoś takie jak for (let i ) , może wypadałoby spreparować sobie to co chcemy przelecieć najpierw i potem forem",
  "w tym main jest imageUrl: string",
  "w tym zadaniu koroną było to co widzimy patrząc od góry",
  "w wywolaniu register",
  "w zadaniu rekrutacyjnym byl jeden podpunkt zwiazany z wordpressem",
  "wait",
  "Warto sprawdzić czy SDK nie jest stare, bo ostatnio nowe wprowadzali",
  "wazne zeby wiedziec co sie robi, bo taki tez jest ekosystem, ze korzysta sie z projektow tworzonych przez wolontariuszy, a czasami nawet projekty calkiem zmieniaja api i albo sie zostaje na starej wersji albo przerabia i stosuje nowe metody",
  "wczoraj to wrzucałem",
  "webassembly jest o tyle fajne, że mozesz pisac kod w jakim chcesz jezyku np. C",
  "wezcie mi to przetlumaczcie",
  "while(i++) i--;",
  "wiadomo, trzeba robić lepiej, jak jest pole do poprawy",
  "widze ze fajnie odpisales , wiec do ciebie bede kierowal pytanie, tylko bede je konkretyzowal, czy jest ok tak jak ja wsadzam te inputy do tego parenta, czy w ogole to trzeba inaczej zrobic?",
  "widze ze masz przy reakcjach onclick, czy cos jeszcze",
  "widzę, że apkę w rn robiłeś, czemu wybór padł na expo?",
  "widzieliście nowe collabo Apple x Lenovo ?",
  "wiec ciekawa opcja",
  "wiec na pewno podejdzie",
  "wiec podczas jakichs zmian musialoby sie to replikowac na ten wypelniacz np.",
  "wiekszego od kazdego elementu",
  "wiem co to jest np. niepelnoprawne np. react jest pol funkcjonalny, pol obiektowy",
  "wiem na pewno ze klasa ma byc osobna odpowiedzialna za konfigurację, a w obiekcie konfigurowanym jest jakas metoda uzywana i ta klasa konfigurujaca ustawia odpowiedni wskaznik do funkcji",
  "wiem, tylko pytam o opinie, ja np. jakos nie jestem do expo przekonany, wole robić w czystym",
  "wiem, że można tak po prostu, ale ja jestem fanem turbo optymalizacji",
  "wiesz co to są web componenty?",
  "wiesz jaka error ma strukture?",
  "wiesz to mi na początku ktoś zarzucił że po co uzywam typescripta jak daje any, ale mniejsza",
  "wlasnie czytam",
  "wlasnie jak dziala a star",
  "wlasnie macie jakis fajny framework co by go tam dodac?",
  "wlasnie node juz ma import , bo wiem ze to jedna z rzeczy ktore brakowalo i chyba cos jeszcze",
  "właśnie pomyliłeś obrażenie się z frustracją, ale ok niech ci będzie",
  "właśnie szukam jakichś przykładowych implementacji kolejki jak ludzie sobie z tym radzą, bo chyba nie da się inaczej",
  "wlasnie uzywam hooka na dimensions, tylko obecnie po to zeby na wersji przegladarkowej dzialal kontener tak samo jak na mobilkach, w skrocie na mobilkach jak masz view z flex: 1, to sie rozszerza, a na desktopach nie",
  "wrzuc jakiegos screena, to moze cos mi wpadnie",
  "wszystko jest dostepne",
  "wszystko jest obiektem w js",
  "wszystko na nie",
  "wtedy masz pelna kontrole nad tym jakby to dzialalo i jaki mialoby styl",
  "wtedy tą samą funkcją możesz operować i na bazowym i na obiekcie pochodnym",
  "wy tu wszyscy z jednej paczki jestescie ze jednym glosem odpowiadacie?",
  "wydaje mi sie ze moglbys miec tego graphqla z generatorem typow",
  "wydaje mi się że warto sobie przyswoić jaka jest roznica miedzy preactem a reactem, i dlaczego ten pierwszy jest bardziej kompaktowy",
  "wydaje mi się, że i tak nie jest to zbytnio pomocne w rozwiązaniu tego problemu, albo źle zrozumiałem ideę tej funkcjonalności",
  "wygląda jak autokorekta",
  "wygląda przyszłościowo",
  "wymyślił tam coś takiego, że się co chwilę robią screeny i są przesyłane",
  "wymyślmy koło od nowa",
  "wysłanie tego formularza skutkuje dodaniem wpisu do bazy danych i w przypadku jak nie będzie to string ma to być defaultowy url",
  "yarn audit ?",
  "z czego wiekszosc dostępna pod defaultowym haslem",
  "z formdata",
  "z Intelem jeszcze da się radę, a do Nvidii trzeba być bogiem",
  "z kolei abstract class wymusza zeby byla zgodnosc",
  "z kolei jeżeli pola są podobne i np. roznia sie tylko nazwą, to renderowanie z np. arraya nazw nie powinno byc takie zle",
  "z ksiazki glownie pamietam glownie wyjasnianie obiektow lacznie z prototypami, i jakies tam inne",
  "z takich implementacji jakie znalazlem to np. ta https://codesandbox.io/s/wn09v3x4y7?file=/src/index.js",
  "z tego co widze to lapie event tak jak by sie na elemencie robilo tylko ze tym elementem jest window",
  "z tego co widze to null będzie jak pole jest puste",
  "z tego co wiem takich podobnych uslug jest chyba multum, ale tak zeby sobie cos samemu za 0 plnow zrobic to nie bardzo",
  "z tym api dajacym csv",
  "z tym elixirem chodzi glownie o wydajnosc?",
  "z tym zeby wstawic ja do srodka nie powinno byc problemu",
  "Z zawodu jestem ekonomistą i dorabiam sobie w ministerstwie zdrowia, ale programowanie kręci mnie jak \"jasny chuj\"",
  "za chwile najpierw to musze ogarnac bo cos nie moge sobie przykladu zrobic",
  "za dawanie dupy też są kox pieniądze",
  "za to ty wiesz",
  "zajebista oferta, kupilbym jakbym mial pieniadze albo nie mial laptopa",
  "zalezy co jest celem, czy jakas ekstra wydajnosc czy cos innego",
  "Zależy co też chcemy osiągnąć, jaki stan apki w obecnej chwili, czy chodzi ci o to ze poki co jest wersja mobilna stara, a docelowo ma byc nowa i do tego strona?",
  "zalozenie jest takie ze jest form w ktorym sa checkboxy i chce za pomoca jednego odrębnego ustawiac wszystkie na on albo off",
  "zamiast backoffice chyba powinien byc backend",
  "zanim on to jeszcze nagral, to probowalem z tego co pamietam tej biblioteki ktora on tam uzywa, ale chyba cos mi sie nie chciala pod windowsem skompilowac",
  "zauwazylem ze pick nie dziala jak wlasciwosci sa private",
  "zawsze",
  "zbiera jakieś identyfikatory z systemu",
  "zdaje sie ze to jest problem z cyklu just javascript things",
  "zdarzyło mi się przeczytac ksiazke o javascript i nie było tam, tak wiem dowod anegdotyczny",
  "zdejmij kaganiec",
  "ze index 4 > index 3 > reszta",
  "ze jak ma sie <form> i w srodku <input>\ni submituje sie forma to znane sa ustawienia inputow",
  "ze jest jakis blad, chodzi mi o podkreslenie",
  "że masz np. obiekt bazowy i do niego doklejasz cos w nowej strukturze",
  "ze nie jest taki obiekt jak powinien byc",
  "ze sie parametry nie zgadzaja",
  "że stan jest do renderowania to jest antypattern?",
  "ze tez nie robie rerenderow",
  "ze wiele umow opakowanych w jedną inną",
  "ze zmienna?",
  "ze zmienne trzeba nazywac, tak jezeli wie co sie robi i ma to sens",
  "zeby dobrze dane mielilo",
  "zeby miec fallback wsparcie dla starych restauracji, bramka voip i zamowienie czyta syntezator mowy",
  "zeby rysowac drzewo z pliku",
  "zeby sie w cos nie wpieprzyc",
  "zeby szybko projekt postawic",
  "zgadza się tak to działa w aplikacjach czy grach 3d",
  "zgadza sie to zrobie",
  "zgadza sie",
  "znacie jakieś fajne systemy operacyjne napisane w javascript ?",
  "znacie jakis framework do szybkiego robienia quizów?",
  "znacie jakis szybki zestaw komend na gatsbyego z typescriptem?",
  "znacie partytown?",
  "znaczy chyba byłoby to mało-otypowane w takim przypadku",
  "znaczy ogolnie blokowalo tak jakby zeby ktos sobie nie zapisywał",
  "znaczy sie nie do konca",
  "znalazłem jakieś ale przeterminowane, bo jakis typ stary mają",
  "znam to nawet dzisiaj mi sie zdarzylo kolejny raz obejrzec",
  "znasz jakis przyklad gier robionych funkcyjnie?",
  "znowu odbijasz od tematu ja kasuje swoje, mozesz gadac do sciany jak chcesz",
  "zobacze jak google ma",
  "zrobi sie array tablica of MasterCard \nfor (const user of discord){\n        array.push(user.card)\n}\ni pozniej Math.random",
  "zrobiłem pewnie podobnie tak jak tam jest, tylko ze rekurencyjnie"
]
